{"தமிழ்த் திரைப்படப் பாடகர்களின் பட்டியல்": "இப்பக்கம் தமிழ்த் திரைப்பட பாடகர்களை அகரவரிசையில் பட்டியல் இடுகிறது.\n\nஉதித் நாராயண்\nஉன்னிகிருஷ்ணன்\nஉன்னிமேனன்\nஎஸ். பி. பாலசுப்பிரமணியம்\nஎஸ். பி. பி. சரண்\nஎஸ்.சி.கிருஷ்ணன்\nஏ. எம். ராஜா\nஏ.எல்.ராகவன்(பாடகர்)\nகார்த்திக்\nகே. ஜே. யேசுதாஸ்\nசங்கர் மகாதேவன்\nசந்திரபாபு\nசி.எஸ்.ஜெயராமன்\nசீர்காழி கோவிந்தராஜன்\nடி. எம். சௌந்தரராஜன்\nதாராபுரம் சுந்தரராஜன்\nதிப்பு\nதிருச்சி லோகநாதன்\nபி. பி. ஸ்ரீநிவாஸ்\nமது பாலகிருஷ்ணன்\nமலேசியா வாசுதேவன்\nமனோ\nவிஜய் யேசுதாஸ்\nஜெயச்சந்திரன்\nஸ்ரீநிவாஸ்\nஹரிஷ் ராகவேந்திரா\nஹரிஹரன்", "தமிழ்த் திரைப்படப் பாடகிகளின் பட்டியல்": "", "அருண்மொழி (பாடகர்)": "அருண்மொழி என்று அறியப்படும் நெப்போலியன், இந்திய திரைப்பட பாடகராவார். 1980களில் இசையமைப்பாளர் இளையராஜாவின் பின்னணி இசைக்குழுவில் புல்லாங்குழல் வாசித்த இவரை சூரசம்ஹாரம் திரைப்படத்தில் நான் என்பது நீயல்லவோ தேவ தேவி எனும் பாடல் மூலமாக பாடகராக இளையராஜா அறிமுகப்படுத்தினார். இசையமைப்பாளர்கள் தேவா, சிற்பி, எஸ். ஏ. ராஜ்குமார், ஏ. ஆர். ரகுமான் உள்ளிட்ட பலர் இசையமைத்த திரைப்படங்களில் அருண்மொழி பாடியிருந்தாலும் இளையராஜா இசையமைத்த திரைப்படங்களில் பாடியதே அதிகம். அப்பாடல்கள், மக்களிடையே பெரும் வரவேற்பையும் பெற்றன.", "அருண்ராஜா காமராஜ்": "அருண்ராஜா காமராஜ் (ஆங்கிலம்:Arunraja Kamaraj) என்பவர் தமிழ் திரைப்பட துறையில் நடிகர், பாடகர், பாடலாசிரியர், எழுத்தாளர், நகைச்சுவை நடிகர், இயக்குனர் என பன்முகம் கொண்டவர். இவர் தெறி, பென்சில், கபாலி மற்றும் ஜிகர்தண்டா முதலிய திரைப்படங்களுக்கு பாடலாசிரியராக பணியாற்றி அனைவரின் பாராட்டைப் பெற்றார். மேலும் இவர் ராஜா ராணி திரைப்படத்தின் மூலம் ஒரு நடிகனாக அறிமுகமானார். மான் கராத்தே படத்தில் நெருப்பு குமார் என்ற கதாபாத்திரத்தில் நடித்தார்.", "அல்கா அஜித்": "அல்கா அஜித் (Alka Ajith) ( மலையாளம்: അൽക്കാ അജിത്‌   ) ஒரு இந்திய பின்னணி பாடகர் ஆவார். விஜய் தொலைக்காட்சியில் ஒளிபரப்பப்பட்ட தமிழ் மொழி இசை போட்டி உண்மை நிலைநிகழ்ச்சியான ஏர்டெல் சூப்பர் சிங்கர் ஜூனியரின்  பருவம் 2 ஐ வென்றதில் மிகவும் பிரபலமானவர். அவருக்கு 2017 ஆம் ஆண்டில் ஜெய்சி அறக்கட்டளையின் சிறந்த பெண் பாடகர் விருது வழங்கப்பட்டது.", "அறிவு (பாடகர்)": "அறிவு என பொதுவாக அறியப்படும்  அறிவரசு கலைநேசன் என்பவர் ஒரு  இந்திய சொல்லிசை, பாடலாசிரியர், மற்றும் பின்னணிப் பாடகர் ஆவார். இவர் பொதுவாக தமிழ் திரைப்படங்களில் பணியாற்றுகின்றார். அனிருத்தின் இசையமைப்பில்  மாசுடர் (2021) படத்திற்காக இவர் எழுதிய \"வாத்தி இரைடு\" பாடலுக்காகவும்,  தீஉடன் இணைந்து இவர்  பாடிய  \" எஞ்சாய் எஞ்சாமி \"  என்ற ஒற்றை பாடலுக்காகவும் இவர் அறியப்படுகிறார்.", "அனிதா கார்த்திகேயன்": "அனிதா கார்த்திகேயன் (Anitha Karthikeyan) ஒரு பின்னணிப் பாடகர்  ஆவார். இசைக் குடும்பத்தில் இருந்து வந்தவரான திரு. கே. வெங்கடநரசிம்மன் மற்றும் டாக்டர் (திருமதி.) வி. மதுரம் ஆகியோருக்கு மகளாக 13, திசம்பரில் பிறந்தவர். அனிதா, சென்னையிலுள்ள எத்திராஜ் கல்லூரியில் கணினி அறிவியல் பிரிவில் இளங்கலைப் பட்டம் பெற்றார். பின்னர், எம்.ஒ.பி. வைஷ்ணவா மகளிர் கல்லூரியில் எம்.எஸ்.சி. தகவல் தொழில்நுட்பம் பிரிவில் முதுகலை பட்டம் பெற்றார்.    படித்துக்கொண்டிருக்கும் போதே, அவர் பாரம்பரிய இசையிலும், அகஸ்டின் பால் வழிகாட்டலின் கீழ் லண்டன் டிரினிட்டி கல்லூரியில் 8 வது நிலை வரை பயிற்சி பெற்றார். மற்றும் இந்துஸ்தானி இசையை திருமதி. மேக்னா தாண்டேகர் என்பவரிடமிருந்து கற்றுக்கொண்டார்.", "அனிருத் ரவிச்சந்திரன்": "அனிருத் ரவிச்சந்திரன் (Anirudh Ravichander), ஓர் இந்திய திரைப்பட இசையமைப்பாளரும், பின்னணிப் பாடகரும் ஆவார். இவர் தமிழ்த் திரைப்படங்களில் இசையமைத்து வருகிறார். இவர் இசையமைத்த முதல் திரைப்படம் 3 ஆகும். இந்த 3 திரைப்படத்தின் வொய் திஸ் கொலவெறி டி என்ற பாடலின் மூலம் மிகவும் பிரபலமடைந்தார். இவரது இசை பயணத்தின் தொடக்கத்தில் தனுஷ் நடித்த அல்லது தயாரித்த படங்களுக்கு மட்டுமே இசை அமைத்து வந்த இவர், தற்போது மற்ற படங்களுக்கும் இசையமைத்து வருகிறார்.", "அனுபமா": "அனுபமா ஒரு தமிழ் திரைப்படப் பின்னணிப் பாடகி. ஏ. ஆர். ரகுமான் இசையமைப்பில் திருடா திருடா படத்தில் இடம்பெற்ற கொஞ்சம் நிலவு பாடல் தான் அனுபமா பாடிய முதல் திரைப்படப் பாடல் ஆகும்.", "ஆலாப் இராசு": "ஆலாப் இராசு (பிறப்பு 6 சூன் 1979) இந்தியாவின் சென்னையைச் சேர்ந்த பின்னணி பாடகரும், கித்தார் இசைக் கலைஞருமாவார்.  ஹாரிஸ் ஜயராஜ் இசையமைத்த கோ திரைப்படத்திலிருந்து \"என்னமோ ஏதோ\" என்ற பாடலை பாடியது 2011ஆம் ஆண்டில் பல மாதங்களுக்கு இசை பட்டியலில் முதலிடத்தைப் பிடித்தது. மேலும், சிறந்த ஆண் பின்னணி பாடகருக்கான பிலிம்பேர் விருதையும் வென்றது. ஹாரிஸ் ஜெயராஜ், தமன், ஜி. வி. பிரகாஷ் குமார், தீபக் தேவ், டி. இமான், ஸ்ரீகாந்த் தேவா போன்ற இசை இயக்குனர்களுக்காக இவர் பாடியுள்ளார். முகமூடி படத்திலிருந்து \"வாய மூடி சும்மா இருடா\", எங்கேயும் காதல் படத்தில் \"எங்கேயும் காதல்\", நண்பன் படத்தில் இடம்பெற்ற \"எந்தன் கண் முன்னே\" பாடலும், ஒரு கல் ஒரு கண்ணாடி படத்தின் \"அகிலா அகிலா\", \"காதல் ஒரு பட்டர்பிளை\" பாடலும் வந்தான் வென்றான் படத்தின் \"அஞ்சனா அஞ்சனா\", ஐய்யனார் படத்தின் \"குத்து குத்து\", யுவ் என்ற மலையாளப் படத்திலிருந்து \"நெஞ்சோடு சேர்த்து\", மாற்றான் படத்திலிருந்து \"தீயே தீயே\", மனம் கொத்திப் பறவை படத்திலிருந்து \"ஜல் ஜல் ஓசை\", என்னை அறிந்தால் படத்தின் \"மாயா பஜார்\" போன்ற பாடல்கள் இவருக்கு பெயர் பெற்றுத் தந்தது.", "ஆஷா போஸ்லே": "ஆஷா போஸ்லே (Asha Bhosle  (பிறப்பு 8 செப்டம்பர் 1933) ஓர் இந்தியப் பின்னணி பாடகர் மற்றும் ஒரு தொழில்முனைவோர் ஆவார். அவர் இந்தி சினிமாவில் பின்னணி பாடுவதன் மூலம் பரவலாக அறியப்படுகிறார், இருப்பினும் அவர் பல திறனைக் கொண்டிருந்தார்..  போஸ்லேவின் தொழில் வாழ்க்கை 1943 இல் தொடங்கி ஆறு தசாப்தங்களுக்கும் மேலாக நீடித்தது. அவர் ஆயிரத்துக்கும் மேற்பட்ட பாலிவுட் திரைப்படங்களுக்கு பின்னணி பாடல் பாடியுள்ளார். மேலும், தனிப் பாடல் தொகுதிகளையும் பாடியுள்ளதோடு இந்தியாவிலும் வெளிநாட்டிலும் ஏராளமான தனி இசை நிகழ்ச்சிகளில் பங்கேற்றார்.  2006 ஆம் ஆண்டில், ஆஷா போஸ்லே 12,000 க்கும் மேற்பட்ட பாடல்களைப் பாடியதாகக் கூறினார்,  2011 ஆம் ஆண்டில், கின்னஸ் புத்தகத்தால் உலக வரலாற்றில் அதிக பதிவு செய்யப்பட்ட கலைஞராக அவர் அதிகாரப்பூர்வமாக அறிவிக்கப்பட்டார்.  இந்திய அரசு 2000 ஆம் ஆண்டில் தாதாசாகேப் பால்கே விருதையும் 2008 இல் பத்ம விபூஷன்  விருதையும் வழங்கியது . போஸ்லே பின்னணி பாடகியான லதா மங்கேஷ்கரின் சகோதரி ஆவார்.", "இலத்திகா": "இலத்திகா (Lathika)  இவர் ஓர் இந்திய பின்னணி பாடகர் ஆவார். 1980களின் பிற்பகுதியிலிருந்து 1990களின் முற்பகுதி வரை மலையாள திரைப்படத் துறையில் இசை விளக்கப்படங்களில் குரல் கொடுத்துள்ளார். 300க்கும் மேற்பட்ட படங்களுக்கு முக்கியமாக மலையாளம் மற்றும் தமிழ்த் திரைப்பட பாடல்களுக்காக இவர் குரல் கொடுத்துள்ளார். அந்தக் காலத்தின் இவரது சில புகழ் பெற்ற பாடல்கள் 'கத்தோடு கதோரம்…' மற்றும் 'தேவதூதர் பாடி…' ( கத்தோடு கதோரம் 1985 படம் ), 'பூ வேனம் பூப்பாத வேனம்…' (ஒரு மின்னாமினுங்கின்டே நூருங்குவெட்டம் ), மற்றும் 'தரும் தலிரும்…' ( சிலம்பு ) ஆகியன.", "இலதா இரசினிகாந்து": "இலதா இரசினிகாந்து ஓர் இந்தியத் திரைப்படத் தயாரிப்பாளர் மற்றும் பின்னணிப் பாடகி ஆவார். இவர் நன்கறியப்பட்ட இந்தியத் திரைப்பட நடிகர் இரசினிகாந்தின் மனைவியும் ஆவார். இவரால் தொடங்கப்பட்ட ஆசிரமத்தின் தலைவராகவும், சென்னையில் இயங்கிவரும் ஒரு பள்ளிக்குத் தலைவராகவும், இவை தவிர் இவரது மகள்களுக்குச் சொந்தமான திரைப்படத் தயாரிப்பு நிறுவனமான ஆச்சேர் ஸ்டுடியோஸ் நிறுவனத்தின் நிர்வாக இயக்குனராகவும் உள்ளார்.", "இலா அருண்": "இலா அருண் (Ila Arun) ஒரு பிரபலமான இந்திய நடிகை, தொலைக்காட்சி ஆளுமை மற்றும் ராஜஸ்தானிய நாட்டுப்புற  பாப் பாடகர் ஆவார். ஒரு தனித்துவமான, ''ஹஸ்கி''குரல்  நாட்டுப்புற பாப் பாடல்களுக்கு ஒரு தனித்துவத்தை அளிக்கிறது.  அவரது மகள் இஷிதா அருண் லாமே , ஜோதா அக்பர் , ஷாடி கே சைட் எஃபெக்ட்ஸ் மற்றும் சமீபத்தில் பேகம் ஜான் போன்ற பல முக்கிய பாலிவுட் திரைப்படங்களில் அவர் தோன்றியுள்ளார்.", "இளையராஜா": "இளையராஜா (Ilaiyaraaja, பிறப்பு: சூன் 2, 1943) இந்தியாவின் சிறந்த திரைப்பட இசையமைப்பாளர்களுள் ஒருவர் ஆவார். இவர் அன்னக்கிளி என்ற திரைப்படத்துக்கு இசை அமைத்ததன் மூலம் 1976 இல் தமிழ் திரையுலகிற்கு அறிமுகமானார். இதுவரை 1000 க்கும் மேற்பட்ட தமிழ், தெலுங்கு, மலையாளம், கன்னடம், இந்தி திரைப்படங்களுக்கு இசையமைத்துள்ளார். இவருக்கு, இந்திய அரசின் படத்துறை-சாரா விருதுகளில் மூன்றாவது உயரிய விருதான, பத்ம பூஷண் விருது 2010 ஆம் ஆண்டு வழங்கப்பட்டது.\nஇளையராஜாவுக்கு, இந்திய நாட்டின் இரண்டாவது உயரிய விருதான பத்ம விபூஷண் விருது, 25 சனவரி 2018 அன்று, இந்திய அரசால் அறிவிக்கப்பட்டது.தமிழக நாட்டுப்புற இசை, கருநாடக இசை மற்றும் மேற்கத்திய இசையில், புலமையும், முறையான பயிற்சியும் பெற்றவர். சிறந்த இசையமைப்பாளருக்கான தேசிய விருதை நான்கு முறை பெற்றுள்ளார். திரைப்படங்களுக்கான சிறந்த பின்னணி இசையமைப்புக்கும் பெயர் பெற்றவர்.\nஇவர் மேற்கத்திய இசைக் கருவிகளை கையாளும் திறன்படைத்த மாஸ்டர் தன்ராஜிடம் மேற்கத்திய இசையைப் பயின்றவர்.", "உதித் நாராயண்": "உதித் நாராயண் (Udit Narayan பிறப்பு: டிசம்பர் 1, 1955)  ஓர் இந்தியப் பின்னணி பாடகர் ஆவார். இவரது பாடல்கள் முக்கியமாக இந்தி மொழியின் பாலிவுட் திரைப்படங்களில் இடம்பெற்றுள்ளன. தெலுங்கு, தமிழ், கன்னடம், ஒடியா, நேபாளி, போஜ்புரி, பெங்காலி உள்ளிட்ட பல்வேறு மொழிகளிலும் பாடியுள்ளார். அவர் 4 தேசிய திரைப்பட விருதுகளை வென்றுள்ளார்  மற்றும் 5 பிலிம்பேர் விருதுகளைப் பெற்றுள்ளதுடன் அந்த விருதுக்கு 20 முறை பரிந்துரைக்கப்ப்ட்டதுடன் பல விருதுகளையும் பெற்றுள்ளார். 1980 இல் பாலிவுட் பின்னணியில் அறிமுகமான பிறகும் அவர் சிறப்பான இடத்தினைப் பெற நிறைய போராட வேண்டியிருந்தது. 1980 ஆம் ஆண்டில் யுனீஸ்-பீஸ் திரைப்படத்தில் பாலிவுட் பின்னணிப் பாடகர்களான  முகமது ரஃபி மற்றும் 1980 களில் கிஷோர் குமார் ஆகியோருடன் அவர் பாடினார். அவர் இறுதியாக 1988 ஆம் ஆண்டில் அமீர் கான் மற்றும் ஜூஹி சாவ்லா நடித்த கயாமத் சே கயாமத் தக் திரைப்படத்தில் தனது சிறப்பான திறனை வெளிப்படுத்தினார், அவரது பாடல் \"பாப்பா கெஹ்தே ஹைன்\" அவரது குறிப்பிடத்தக்க பாடலாக அமைந்தது, இது 1980 களில் அவரது முதல் பிலிம்பேர் விருதைப் பெற்றது, மேலும் அவர் பாலிவுட் பின்னணி பாடலில் தன்னை முன்னணி பாடகராக நிலைநிறுத்திக் கொண்டார். பிலிம்பேர் விருதுகளின் வரலாற்றில் மூன்று தசாப்தங்களுக்கும் மேலாக  விருது பெற்ற (1980 கள், 1990 கள் மற்றும் 2000 கள்) வென்ற ஒரே ஆண் பாடகர் இவர் ஆவார்.", "எம். எம். மானசி": "எம். எம். மானசி என்பவர் ஒரு இந்துஸ்தானி பிண்ணணி பாடகியாவார். இவர் தமிழ், தெலுங்கு, கன்னடம், மலையாளம், இந்தி, ஆங்கிலம் ஆகிய மொழிகளில் சுமார் 170 பாடல்களை பாடியுள்ளார். இவர் டி. ஜி வைஷ்ணவா கல்லூரியில் முதுகலை நிர்வாகத்தை (MBA) பயின்றார். இவர் பாடிய பாடல்கள் மிகவும் பிரபலமானவை சில: தமிழச்சி (ஆரம்பம்), கட்டிகிட (காக்கி சட்டை), ரோபோ ரோமியோ (தமிழுக்கு எண் ஒன்றை அழுத்தவும்), ஆட்டக்கார மாமன் பொண்ணு (தாரை தப்பட்டை - இசைஞானி இளையராஜாவின் 1000ஆவது படமாகும்).", "எம். எஸ். இராஜேஸ்வரி": "எம். எஸ். இராஜேஸ்வரி (பெப்ரவரி 24, 1932 - ஏப்ரல் 25, 2018) தமிழ்த் திரைப்பட பின்னணிப் பாடகி ஆவார். சுண்டலிக்கும் சுண்டலிக்கும் கல்யாணமாம் (கைதி கண்ணாயிரம்), சிட்டுக் குருவி சிட்டுக்குருவி சேதி தெரியுமா (டவுன் பஸ்) போன்ற  குழந்தைத்தனமான பாடல்களால் பரவலாக அறியப்படுகிறார். நடிகர் கமலஹாசன் தமது திரைப்பட வாழ்வைத் தொடங்கிய களத்தூர் கண்ணம்மா திரைப்படத்தில் அம்மாவும் நீயே அப்பாவும் நீயே என்ற குழந்தைப்பாடல் இன்றும் நினைவு கூரப்படுகிறது. 500 பாடல்களுக்கும் மேலாகப் பாடியுள்ள இராசேச்வரி 1947இல் தமது திரையுலக வாழ்வை ஏவிஎம் நிறுவனத்தின் நாம் இருவர் திரைப்படத்தில் துவங்கினார். முதன்மை திரை பின்னணிப் பாடகர்களான டி.எம்.சௌந்தரராஜன், சீர்காழி கோவிந்தராஜன், ஏஎம் இராஜா, கே.ஜே.யேசுதாஸ், எஸ். பி. பாலசுப்பிரமணியன் ஆகியோருடன் தமிழ், தெலுங்கு, மலையாளம் மற்றும் கன்னட மொழிகளில் பாடியுள்ளார்.", "எம். கே. பாலாஜி": "எம். கே. பாலாஜி (MK Balaji) என்பவர் ஒரு இந்திய ஒன்றியம், தமிழ்நாட்டின் சென்னையைச் சேர்ந்த பாடகர், பாடலாசிரியர், தொலைக்காட்சி தொகுப்பாளர் ஆவார். இவர் பின்னணி பாடகராக  தமிழ், தெலுங்கு, கன்னட மொழிகளில் 200 க்கும் மேற்பட்ட பாடல்களை பாடியுள்ளார். இவர் சேதுபதி படத்தின் வழியாக பாடலாசிரியராகவும் அறிமுகமானார். மேலும் இவர்  விஜய் தொலைக்காட்சி மற்றும் ஜீ தமிழில் பிரபலமான தொலைக்காட்சி நிகழ்ச்சிகளை தொகுத்து வழங்கியுள்ளார்.", "எம். ஜி. ஸ்ரீகுமார்": "எம்.ஜி. ஸ்ரீகுமார்  (M. G. Sreekumar), (பிறப்பு: மே 25, 1958) மலையாள படவுலகில்,இரண்டு முறை தேசிய விருது  பெற்ற  இந்திய பின்னணிப் பாடகர் மற்றும் இசை இயக்குனர் ஆவார். இவர்,  மலையாளம் , தமிழ் , தெலுங்கு , கன்னடம் மற்றும் இந்தி மொழிகளில்  பாடியுள்ளார்.  இவர், இசையமைப்பாளர் எம்.ஜி. ராதாகிருஷ்ணன் மற்றும் பாடகி கே. ஓமனகுட்டி ஆகியோரின் இளைய சகோதரர் ஆவார்.  இவர், கே.எம்.ஜி மியூசிக்ஸ் என்ற இசை நிறுவனத்தையும், மற்றும்  திருவனந்தபுரத்தில் உள்ள பூஜப்புராவில்  சரிகம என்கிற பெயரில் இசைப் பள்ளியையும் நடத்தி வருகிறார்.", "எல். ஆர். ஈஸ்வரி": "எல். ஆர். ஈஸ்வரி (பிறப்பு: திசம்பர் 7, 1939) தமிழ்நாட்டின் பிரபலமான ஒரு திரைப்படப் பின்னணிப் பாடகி. 1958 ஆம் ஆண்டில் இருந்து திரைப்படங்களில் பாடி வரும் இவர் ஆயிரக்கணக்கான பாடல்களை பல மொழிகளில் பாடியுள்ளார்.", "என். எல். கானசரஸ்வதி": "என். எல். கானசரஸ்வதி ஒரு இந்திய திரைப்படப் பின்னணிப் பாடகியாவார். 1950 களிலும், 1960 களின் முற்பகுதியிலும் இவர் பல திரைப்படங்களில் பின்னணி பாடியுள்ளார். அநேகமாக தமிழ்த் திரைப்படங்களில் பாடியுள்ள இவர் ஏனைய தென்னிந்திய மொழிப் படங்கள் சிலவற்றிலும் பாடியுள்ளார். இவர் பாடிய பாடல்கள் பெரும்பாலும் கருநாடக இசையை அடிப்படையாகக் கொண்டவை. அவை திரைப்படங்களில் நடனக் காட்சிகளுக்குப் பயன்படுத்தப்பட்டன.", "எஸ். என். சுரேந்தர்": "௭ஸ். ௭ன் சுரேந்தர் தமிழ் திரைப்படப் பின்னணிப் பாடகர் மற்றும் பின்னணி பேசும் கலைஞர் ஆவார். தமிழ், தெலுங்கு, மலையாளம் மற்றும் கன்னடம் மொழிகளுக்கு பல்வேறு இசை இயக்குநர்களின் கீழ் 500 க்கும் மேற்பட்ட பாடல்களைப் பாடியுள்ளார். அவர் ஒரு தொழில்முறை பின்னணிக்குரல் கலைஞராகவும் உள்ளார், கிட்டத்தட்ட 600 படங்களுக்கு பின்னணிக்குரல் கொடுத்துள்ளார், அவற்றில் 75 க்கும் மேற்பட்ட படங்கள் நடிகர் மோகனுக்கானவை. சுரேந்தர் யாகசாலை திரைப்படத்தில் நடித்துள்ளார்.", "எஸ். சி. கிருஷ்ணன்": "எஸ். சி. கிருஷ்ணன்  சௌராட்டிர சமூகத்தைச் சேர்ந்த தென்னிந்தியாவின் பழம்பெரும் திரைப்படப் பின்னணிப் பாடகர் ஆவார். 1950களில் தமிழ்திரைப்படங்களில் பல பாடல்களைப் பாடியுள்ளார். தமிழர் உள்ளத்தில் நீங்கா இடம் பிடித்த 'அத்தானும் நான் தானே', 'சித்தாடை கட்டிக்கிட்டு', 'மண்ணை நம்பி மரமிருக்கு' ஆகிய பாடல்களைப் பாடியுள்ளார்.", "எஸ். பி. சைலஜா": "எஸ். பி. சைலஜா (S. P. Sailaja) (பிறப்பு: சூலை 22, 1953) ஒரு தென்னிந்தியத் திரைப்படப் பாடகி, பின்னணி குரல் கொடுப்பவரும் நடனக் கலைஞரும் ஆவார். இவர்   தமிழ் தெலுங்கு கன்னடம் மலையாளம் ஆகிய மொழிகளில் 5000க்கும் அதிகமான பாடல்கள் பாடியுள்ளார்.", "எஸ். பி. பாலசுப்பிரமணியம்": "எஸ். பி. பாலசுப்பிரமணியம் (S. P. Balasubrahmanyam, 4 சூன், 1946 – 25 செப்டம்பர், 2020), இந்தியத் திரைப்படப் பின்னணிப் பாடகரும், இசையமைப்பாளரும், நடிகரும், தயாரிப்பாளரும் ஆவார். இவர் எஸ்.பி.பி. (SPB) என்ற முன்னெழுத்துகளாலும் எஸ். பி. பாலு  என்றும் பரவலாக அறியப்படுகிறார். இவர் தெலுங்கு, தமிழ், கன்னடம், இந்தி மற்றும் மலையாளத் திரைப்படங்களில் அதிகமாகப் பணியாற்றியுள்ளார். 1966 முதல் திரைப்படங்களில் பாடத் தொடங்கி, 40,000 இற்கும் அதிகமான பாடல்களை 16 இந்திய மொழிகளில் பாடியுள்ளார்  இவர் \"பாடும் நிலா\"\nஎன்று  அழைக்கப்படுகிறார்.\nஇவர் கன்னடம், தெலுங்கு, தமிழ், இந்தி மொழிகளில் ஆறு சிறந்த ஆண் பின்னணிப் பாடகருக்கான தேசியத் திரைப்பட விருதுகளையும்; ஆந்திர மாநிலத்தின் 25 நந்தி விருதுகளையும், மற்றும் பல கருநாடக, தமிழ்நாடு அரசு விருதுகளையும் பெற்றுள்ளார். அத்துடன், பிலிம்பேர் விருது, ஆறு தென்னிந்திய பிலிம்பேர் விருதுகள் ஆகியவற்றையும் வென்றுள்ளார். உலக அளவில் அதிக எண்ணிக்கையிலான பாடல்களைப் பாடியதற்காக கின்னஸ் உலக சாதனைகள் புத்தகத்தில் இடம் பிடித்துள்ளார். 2012 ஆம் ஆண்டில், இந்தியத் திரைத்துறைப் பங்களிப்புகளுக்காக என்.டி.ஆர் தேசிய விருது இவருக்கு வழங்கப்பட்டது. 2016 ஆம் ஆண்டில் இந்தியத் திரைப்பட ஆளுமைக்கான வெள்ளி மயில் விருது வழங்கப்பட்டது. இந்திய அரசு இவருக்கு பத்மசிறீ (2001), பத்ம பூசண் (2011) விருதுகளையும் வழங்கிச் சிறப்பித்தது. சனவரி 2021இல் இவருக்கு இந்தியாவின் குடிமை விருதுகளில் இரண்டாவது உயரிய விருதான பத்ம விபூசண் வழங்கப்படுவதாக அறிவிக்கப்பட்டது.பாலசுப்பிரமணியம் 2020 செப்டம்பர் 25 இல் கோவிடு-19 தொற்றினால் பாதிக்கப்பட்டுக் காலமானார்.", "எஸ். பி. பி. சரண்": "எஸ். பி. பி. சரண் (S. P. Charan) புகழ்பெற்ற பின்னணிப் பாடகர் எஸ். பி. பாலசுப்பிரமணியத்தின் மகனும் திரைப்பட நடிகராகவும் திரைப்பட பின்னணிப் பாடகராகவும் திரைப்படத் தயாரிப்பாளராகவும் விளங்குபவர். 2007ஆம் ஆண்டு சென்னை 600028 என்ற தமிழ்த் திரைப்படத்தை தயாரித்துள்ளார். 2008ஆம் ஆண்டு வெளியான தமிழ் திரைப்படம் சரோஜாவில் முக்கிய வேடத்தில் நடித்துள்ளார்..இவர் முதலில் தெலுங்கு சினிமா மற்றும் தமிழில் பின்னணி பாடகராக பணியாற்றினார். இவர் 2003 கன்னட திரைப்படமான ஹுடுகிகாகியுடன் நடிப்பில் இறங்கினார், மேலும் 2008 ஆம் ஆண்டு சரோஜா திரைப்படத்தில் நடித்ததற்காக இவர் மிகவும் பிரபலமானவர். இவர் கேபிடல் ஃபிலிம் ஒர்க்ஸ் என்ற திரைப்பட தயாரிப்பு நிறுவனத்தை நிறுவியுள்ளார், மேலும் பல தமிழ் திரைப்படங்களைத் தயாரித்தார், இதில் 2007 ஆம் ஆண்டில் சென்னை 600028 வெற்றியடைந்தது. இவர் தயாரித்த தெலுங்கு திரைப்படம் ஆரண்ய காண்டம் தேசிய திரைப்பட விருது - 2012 இல்  வென்றது.", "எஸ். வி. வெங்கட்ராமன்": "எஸ். வி. வெங்கட்ராமன் (25 ஏப்ரல் 1911 – 7 ஏப்ரல் 1998) தமிழ்த் திரையுலகில் குறிப்பிடத்தக்க இசையமைப்பாளராக விளங்கியவர். நடிகராகவும், பாடகராகவும் தமிழ்த் திரைப்படங்களில் தனது பங்களிப்பினைத் தந்தவர். இருநூறுக்கும் மேற்பட்ட தமிழ், தெலுங்கு, கன்னடம், மலையாளம் மற்றும் இந்தி மொழித் திரைப்படங்களுக்கு இவர் இசையமைத்தார்.", "எஸ். ஜானகி": "எஸ். ஜானகி (S. Janaki, பிறப்பு: ஏப்ரல் 23, 1938) இந்தியாவின் புகழ் பெற்ற திரைப்படப் பாடகி. இவர் தமிழ், தெலுங்கு, கன்னடம், மலையாளம், இந்தி உட்படப் பல இந்திய மொழிகளில் நாற்பதாயிரத்திற்கும் அதிகமான பாடல்களைப் பாடியவர். பல பாடல்களைத் தாமே எழுதி, இசையமைத்துப் பாடியுள்ளார். நான்கு முறை தேசிய விருது பெற்றவர். \nசிஷ்ட்லா ஶ்ரீராமூரிதி ஜானகி (பிறப்பு 23 ஏப்ரல் 1938) இவர் பிரபலமாக அறியப்பட்ட, எஸ் ஜானகி , ஒரு இந்திய பின்னணிப் பாடகர் இருந்து அவ்வப்போது இசை பாடகரை ஆந்திரப் பிரதேசம் . அவர் \"ஜானகியம்மா\" என்று மரியாதையுடன் குறிப்பிடப்படுகிறார், மேலும் இந்தியாவின் மிகச் சிறந்த மற்றும் பிரபலமான பின்னணி பாடகர்களில் ஒருவர். இவர்  தெலுங்கு , கன்னடம் , மலையாளம் , தமிழ் , இந்தி , ஒடியா , பெங்காலி , உள்ளிட்ட 17 மொழிகளில் தனிப்பாடல்கள், டூயட் மற்றும் கோரஸ் பாடல்கள் உள்ளிட்ட திரைப்படங்கள், ஆல்பங்கள், டிவி மற்றும் வானொலியில் 50,000 பாடல்களை  பதிவு செய்துள்ளார்.மராத்தி , துலு , உருது , குஜராத்தி , பஞ்சாபி , கொங்கனி , அசாமி , சிந்தி மற்றும் ஆங்கிலம், ஜப்பானிய, அரபு, ஜெர்மன் மற்றும் சிங்களம் போன்ற மொழிகளிலும் , இருப்பினும் அவரது வாழ்க்கையில் அதிக எண்ணிக்கையிலான பாடல்கள் கன்னடத்தில் இருந்தன, அதைத் தொடர்ந்து மலையாளம் . 1957 ஆம் ஆண்டில் விதியின் விலையாட்டு என்ற தமிழ் திரைப்படத்துடன் தொடங்கி , அவரது வாழ்க்கை ஆறு தசாப்தங்களாக பரவியுள்ளது. \nதென்னிந்தியாவின் \"நைட்டிங்கேல்\" என்று அழைக்கப்படும் ஜானகி,  நான்கு தேசிய திரைப்பட விருதுகளையும் 33 வெவ்வேறு மாநில திரைப்பட விருதுகளையும் வென்றுள்ளார்.  அவள் ஒரு என்னும் விருதினையும் பெற்றுள்ளார். கெளரவ முனைவர்  இருந்து மைசூர் பல்கலைக்கழகம் ,  தமிழ்நாடு அரசு கலைமாமணி  விருது மற்றும் கர்நாடக அரசு கர்நாடக ராஜயுத்சவா விருதும் பெற்றுள்ளார். 2013 ஆம் ஆண்டில், இந்திய அரசு அறிவித்த பத்ம பூஷன் விருதை  ஏற்க மறுத்துவிட்டார், மற்றும் \"மிகவும் தாமதமாக\" வந்துவிட்டது என்றும் தென்னிந்திய கலைஞர்களுக்கு தகுந்த அங்கீகாரம் வழங்கப்படவில்லை என்றும் சுட்டிக்காட்டினார். \nமிகவும் பல்துறை பாடகர்களில் ஒருவராக பரவலாகப் பாராட்டப்பட்ட, பாடகர் எஸ்.பி.பாலசுப்பிரமண்யம் மற்றும் இசையமைப்பாளர் இளையராஜா ஆகியோருடனான அவரது கூட்டணி அதிகம் பேசப்படுகிறது. 1960 கள், 1970 கள் மற்றும் 1980 களில் பிபி ஸ்ரீனிவாஸ் , எஸ்.பி.பாலசுப்பிரமண்யம், கே.ஜே.யேசுதாஸ் , பி. ஜெயச்சந்திரன் மற்றும் டாக்டர். அனைத்து தென்னிந்திய மொழிகளிலும் ராஜ்குமார் முதலிடத்தில் உள்ளார்.  அவர் கிட்டத்தட்ட அனைத்து வகை பாடல்களிலும் பாடியுள்ளார். அக்டோபர் 2016 இல், ஜானகி திரைப்படங்கள் மற்றும் மேடை தோற்றங்களுக்காக பாடுவதிலிருந்து ஓய்வு பெறுவதாக அறிவித்தார். இருப்பினும், திரைப்பட சகோதரத்துவத்தின் அழுத்தத்தின் கீழ், அவர் 2018 ஆம் ஆண்டில் பண்ணாடி \nஎன்ற தமிழ் படத்திற்காக மீண்டும் வந்தார்.", "எஸ். ஜே. ஜனனி": "சுப்பிரமணியன் ஜெயா ஜனனி (Subramanian Jaya Jananiy) மேலும் கடலூர் ஜனனி மற்றும் எஸ்.ஜே. ஜனனி என்றும் அறியப்படும் இவர் ஒரு இந்திய இசையமைப்பாளரும், பாடகரும்,பாடலாசிரியரும், பல வாத்திய இசைக் கலைஞரும் ஆவர். இவர்  தமிழ்நாட்டின் சென்னையை அடிப்படையாகக் கொண்டு இயங்குகிறார்.  2001 ஆம் ஆண்டில் இந்திய அரசாங்கத்தால் விதிவிலக்கான சாதனைக்கான தேசிய குழந்தை விருது இவருக்கு வழங்கப்பட்டது. 2003ஆம் ஆண்டில் தமிழக அரசால் கலை இளமணி விருதும் ஜனனிக்கு வழங்கப்பட்டது.  ஜனனி கர்நாடக இசை, இந்துஸ்தானி இசை மற்றும் மேல்நாட்டுச் செந்நெறி இசை ஆகியவற்றில் நன்கு பயிற்சி பெற்றவராவார்.   இவர் விசைப்பலகை , பியானோ  மற்றும் அரங்கப் பதிவுக்காக வயலின், வீணை மற்றும் கிட்டார் ஆகியவற்றையும் வாசிப்பார்.  ஜனனி அகில இந்திய வானொலியின் பி உயர் தர கலைஞர் ஆவார்.", "ஏ. ஆர். ரைஹானா": "ஏ. ஆர். ரைஹானா  ( A. R. Reihana) இந்தியத் திரைப்படப் பின்னணி பாடகி மற்றும் திரைப்பட இசையமைப்பாளினி ஆவார்.இவர் ஏ.ஆர்.ரஹ்மானின் மூத்த சகோதரியும் ஜி. வி. பிரகாஷ் குமார், மற்றும் பவானி ஸ்ரீ ஆகியோரின் தாயுமாவார். இவரது முதல் பாடல் மாதேஷ் தயாரித்து வெங்கடேஷ் இயக்கிய  சாக்லேட் திரைப்படத்திலிருந்து மல்லே மல்லே தேவாவின் இசையில் பாடினார் . 2005 ஆம் ஆண்டில் விருது பெற்ற கன்னத்தில் முத்தமிட்டால் திரைப்படத்தின் பின்னணி இசையில் இவருடைய தம்பி ஏ.ஆர்.ரஹ்மானுடன் ஒரு பாடலில் இணைந்து பணியாற்றினார். இவர் சமீபத்தில் மணிரத்னம் இயக்கிய காற்று வெளியிடை திரைப்படத்தில்  ஒரு பாடலைப் பாடினார். மேலும் சிவாஜி படத்தில் எஸ். பி. பாலசுப்பிரமணியம் மற்றும் பென்னி தயாளுடன் இணைந்து பல்லேலக்கா பாடலைப் பாடினார். கன்னடம் மற்றும் தெலுங்கில் பல்வேறு பாடல்களையும் பாடியுள்ளார். இவர் 6 க்கும் மேற்பட்ட தமிழ் திரைப்படங்களுக்கு இசையமைத்துள்ளார். மலையாள திரைப்படமான வசந்தத்தின் கனல் வாழ்கையில் ஒரு பாடலுக்கு இசையமைத்துள்ளார்.. இவர் மதுரை குமரன் சில்க்ஸ், சுகுணா மோட்டார்கள், டஸ்லர் நைல் பாலிஸ் போன்ற பல்வேறு நிறுவனங்களுக்கு ஜிங்கில்ஸை அமைத்திருக்கிறார். இவர் 'ரையின்ட்ராப்ஸ்' என்று ஒரு இளைஞர் சார்ந்த சமூக அமைப்பின் நல்லெண்ணத் தூதராக இருக்கின்றார்.", "ஏ. எம். ராஜா": "ஏமல மன்மதராஜு ராஜா சுருக்கமாக ஏ. எம். ராஜா (சூலை 1, 1929 - ஏப்ரல் 8, 1989) தென்னிந்தியாவின் பிரபலமான திரைப்படப் பின்னணிப் பாடகர்களுள் ஒருவர். 1950களில் இருந்து 1970கள் வரை தமிழ், தெலுங்கு, கன்னடம் மற்றும் மலையாள மொழிகளில் பல பாடல்களைப் பாடியுள்ளார். அவர் பல படங்களுக்கு இசையமைத்தும் உள்ளார். இவரது மனைவி பிரபலப் பாடகி ஜிக்கி.", "ஏ. எல். ராகவன்": "ஏ. எல். இராகவன் (A. L. Ragavan; 1933 - சூன் 19, 2020), தென்னிந்தியாவின் பழம்பெரும் திரைப்பட நடிகரும், பின்னணிப் பாடகரும் ஆவார். இவர் 1950களில் இருந்து 1970கள் வரை தமிழ்த் திரைப்படங்களில் பல பாடல்களைப் பாடியுள்ளார். இவரது மனைவி பிரபல நடிகை எம். என். இராஜம் ஆவார். இந்த இணையருக்கு பிரம்மா என்ற மகனும், நளினா என்ற மகளும் உண்டு.\nஇவர் அ. லெட்சுமண பாகவதரின் மகனாக, 1933-இல் தஞ்சாவூர் மாவட்டம், பாபநாசம் வட்டம், அய்யம்பேட்டையில் பிறந்தார். ஏ. எல். இராகவன் 1947 ஆம் ஆண்டு கிருஷ்ண விஜயம் திரைப்படத்தில் நடிகராக அறிமுகமானார். அதன்பிறகு சுதர்ஸன் படத்தில் கண்ணனாக நடித்தார். 1950 ஆம் ஆண்டு வெளியான விஜயகுமாரி திரைப்படத்தில் குமாரி கமலாவுக்காக பெண் குரலில் பாடி பாடகராக அறிமுகமானார். அதன்பிறகு எங்கிருந்தாலும் வாழ்க...,  சீட்டுக்கட்டு ராஜா..., என்ன வேகம் நில்லு பாமா..., அங்கமுத்து தங்கமுத்து... உள்ளிட்ட பல பாடல்களால் நன்கு அறியப்பட்டவர். ஏ. எல். இராகவன் சௌராட்டிர சமூகத்தைச் சேர்ந்தவர்.. அன்பே வா திரைப்படத்தில் எம்.ஜி.ஆர். உடன் சேர்ந்து, 'நாடோடி நாடோடி...' என்ற திரைப்பாடலுக்கு நடனம் ஆடினார்.  பிற்காலத்தில் அலைகள், அகல்யா போன்ற தொலைக்காட்சித் தொடர்களில் நடித்துள்ளார். உடல்நிலை பாதிக்கப்பட்ட இராகவன் சென்னை தனியார் மருத்துவமனையில் அனுமதிக்கப்பட்டதில், இவருக்கு கொரோனா வைரசு தொற்று கண்டறியப்பட்டது. இந்நிலையில் 2020 சூன் 19 இறந்தார்.", "ஏ. பி. கோமளா": "ஏ. பி. கோமளா (A. P. Komala, பிறப்பு: 28 ஆகத்து 1934) தென்னிந்தியத் திரைப்படப் பின்னணிப் பாடகி ஆவார். இவர் தமிழ், மலையாளம், தெலுங்கு, கன்னடம் ஆகிய மொழிகளில் பாடல்களைப் பாடியுள்ளார்.\n1940களில் இருந்து 1960களின் நடுப்பகுதி வரை இவர் பல திரைப்படங்களுக்கு பின்னணி பாடியுள்ளார். 1970கள் வரை மலையாளத்தில் தொடர்ந்து பாடி வந்தார். ஜி. ராமநாதன், கே. வி. மகாதேவன், எஸ். வி. வெங்கட்ராமன், ம. சு. விசுவநாதன், சி. எஸ். ஜெயராமன், எஸ். எம். சுப்பையா நாயுடு, டி. ஆர். பாப்பா, வெ. தட்சிணாமூர்த்தி, ஜி. தேவராஜன் போன்ற பல பிரபலமான இசையமைப்பாளர்களின் படங்களில் இவர் பின்னணி பாடியுள்ளார்.\nபெண் மனம், தங்கப்பதுமை, தங்கமலை ரகசியம், மாமியார் மெச்சின மருமகள்‎, பொம்மை கல்யாணம், எங்கள் குடும்பம் பெரிசு, ஸ்ரீ வள்ளி, தாமரைக்குளம் ஆகிய திரைப்படங்களில் இவர் பாடிய பாடல்கள் இடம்பெற்றுள்ளன.", "ஏ. வி. ரமணன்": "ஏ.வி.ராமணன் (ஆரவமுதன் வெங்கட ராமணன்) ஒரு தமிழ் தொலைக்காட்சி தொகுப்பாளர், பாடகர் மற்றும் நடிகர் என பன்முகம் கொண்டவர்.  புகழ்பெற்ற சன் டிவி நிகழ்ச்சியான சப்த ஸ்வரங்கள் நிகழ்ச்சியின் போது நன்கு அறியப்பட்டவராக இருந்தார்.  பின்னணி பாடகி உமா ராமணனை மணந்தார். திரைப்படங்கள், தொலைக்காட்சி தொடர்களில் நடித்துள்ளார். ஏ. வி. ரமணன், உமா ரமணன் தம்பதிகளுக்கு விக்னேஷ் ரமணன் என்ற மகன் உள்ளார். இவர் பொறியயற்பட்டதாரி ஆவார். \nரமணனின் மியூசியானோ என்ற இசைக்குழுவை உருவாக்கினார். அக்குழுவில் விக்னேஷ் ரமணனும், உமா ரமணனும் இணைந்து இசை நிகழ்ச்சிகளை நடத்துவர். \nகண்ணதாசன் இவருக்கு இசை நிலவு என்ற பட்டத்தை வழங்கியுள்ளார்.", "கமல்ஹாசன்": "கமல்ஹாசன் (Kamal Haasan, பிறப்பு:07 நவம்பர் 1954) ஒரு புகழ்பெற்ற இந்தியத் திரைப்பட நடிகரும் மற்றும் அரசியல்வாதியும் ஆவார். இவர் சில திரைப்படங்களை இயக்கியும் உள்ளார். இவரின் மாறுபட்ட வேடங்களைக் கொண்ட நடிப்பிற்காக பரவலாக அறியப்படுகிறார்.கமல்ஹாசன் சிறந்த குழந்தை நட்சத்திரம் மற்றும் சிறந்த நடிகர் என்ற முறையில் 4 தேசிய விருதுகளும், சிறந்த படம் என்ற முறையில் தயாரிப்பாளராக 1 தேசிய விருதும், 10 தமிழக அரசு திரைப்பட விருதுகள்கள், 4 ஆந்திர அரசின் நந்தி விருதுகள், 19 பிலிம்பேர் விருதுகள் உள்ளடங்கலாக பல இந்திய விருதுகளை வென்றுள்ளார், இவர் சிறந்த பிறமொழிப்படத்திற்கான, அகாதமி விருதிற்கு இந்தியாவிலிருந்து பரிந்துரைக்கப்பட்ட திரைப்படங்களில் அதிகமானவற்றிலும் நடித்திருந்தார். நடிகராக மட்டுமல்லாது திரைக்கதையாசிரியர், இயக்குநர், பாடலாசிரியர், பின்னணிப் பாடகர், நடன அமைப்பாளர் எனப் பன்முகத்தன்மை கொண்டவராக விளங்குகின்றார். இந்திய திரைத்துறைக்கு ஆற்றிய பணிக்காக பத்ம பூசண், பத்மசிறீ விருதும் அவருக்கு வழங்கப்பட்டுள்ளது. அத்துடன் சத்தியபாமா பல்கலைக்கழகம் கமல்ஹாசனிற்கு கௌரவ முனைவர் பட்டம் வழங்கி கௌரவித்தது. 2019 இல் 60 ஆண்டுகளை திரைத்துறையில் நிறைவுசெய்த இந்திய நடிகர்கள் மிகச்சிலரில் ஒருவரானார்.\nஇவரின் திரைத்துறை வாழ்க்கையானது 1960 ஆம் ஆண்டில் தமிழில் வெளிவந்த களத்தூர் கண்ணம்மா எனும் திரைப்படத்தில் குழந்தை நட்சத்திரமாக ஆரம்பித்தது. இந்தத் திரைப்படத்தில் நடித்தற்காக ஜனாதிபதி விருது பெற்றார். இவர் அடிக்கடி வாரணம் விஜய் எனும் இயக்குநரைச் சந்திப்பார். அவர் கமல்ஹாசனின் நடிப்பில் சில திருத்தங்களைச் செய்வார். குழந்தை நட்சத்திரமாக 6 திரைபடங்களில் நடித்துள்ளார். துணை நடண ஆசிரியராக தங்கப்பன் அவர்களிடம் சில திரைப்படங்களில் பணியாற்றியுள்ளார். 1973 ஆம் ஆண்டில் கைலாசம் பாலசந்தரின் இயக்கத்தில் வெளிவந்த அரங்கேற்றம் திரைப்படம் இவர் நடித்த முதல் வாலிப வயது திரைப்படம். கன்னியாகுமரி எனும் மலையாள படமே முதன் முதலாக கதாநாயகனாக நடித்து வெளியான திரைப்படமாகும், இத்திரைப்படதிற்காக முதல் பிலிம்பேர் விருது பெற்றார். தனது 25வது படமான அபூர்வ ராகங்கள் எனும் திரைப்படத்தில் முக்கியக் கதாபாத்திரத்தில் நடித்து தமிழுக்கான முதல் பிலிம்பேர் விருது வென்றார்.\n1983 ஆம் ஆண்டில் இயக்குநர் பாலு மகேந்திரா இயக்கிய மூன்றாம் பிறை திரைப்படத்தில் நடித்தார். இந்தப் படத்தில் நடித்ததற்காக சிறந்த நடிகருக்கான  இந்திய தேசிய விருது கிடைத்தது. 1987 இல் மணிரத்னம் இயக்கத்தில் நாயகன் திரைப்படத்திலும், 1996 இல் ஷங்கர் இயக்கத்தில் இந்தியன் 1996 திரைப்படத்திலும் நடித்தார். இந்தத் திரைப்படத்திற்காக இவருக்கு இரண்டாவது மற்றும் மூன்றாவது இந்திய தேசிய விருது கிடைத்தது. இந்த இரு படங்களிலும் இவரின் நடிப்பு பெரும் பாராட்டைப் பெற்றுத் தந்தது. 1992 ஆண்டு சிறந்த மாநில மொழி திரைப்படத்திற்கான தேசிய விருதை தேவர் மகன் படம் பெற்றது, தயாரிப்பாளர் என்ற முறையில் கமல்ஹாசன் தேசிய விருது பெற்றார். இதுவரை 220 க்கும் மேற்பட்ட படங்களில் நடித்துள்ளார். இதில் தசாவதாரம் திரைப்படத்தில் பத்து வேடங்களில் நடித்திருந்தார்.\n1979 ஆம் ஆண்டில் தமிழ்நாடு அரசு கலைமாமணி விருது வழங்கியது. 1990 இல் இந்திய அரசு பத்மசிறீ விருதும், 2014 இல் பத்ம பூசண் விருதும் வழங்கியது. 2016 இல் செவாலியே விருது பெற்றார்.கமல்ஹாசன், தமிழ் தவிர இந்தி, தெலுங்கு, மலையாளம், கன்னடம், வங்காளம் ஆகிய மொழித் திரைப்படங்களிலும் நடித்துள்ளார். ராஜ்கமல் பிலிம்ஸ் இன்டர்நேசனல் என்ற திரைப்படத் தயாரிப்பு நிறுவனத்தையும் நடத்தி வருகின்றார்.", "கல்பனா ராகவேந்தர்": "கல்பனா ராகவேந்திரா, இந்தியப் பின்னணிப் பாடகர் ஆவார். இவர் திரைப்படங்களில் நடிகைகளுக்காக குரல் கொடுத்துள்ளார். இவர் தன் ஐந்தாவது வயதில் இருந்து பாடத் தொடங்கினார். இதுவரையிலும் கிட்டத்தட்ட 1,500 பாடல்களை ப் பாடியுள்ளார். கிட்டத்தட்ட 3,000 மேடைகளில் பாடியுள்ளார்.ஏஷ்யாநெட் மலையாளத் தொலைக்காட்சி வழங்கிய ஸ்டார் சிங்கர் என்ற பாட்டுப் போட்டியின் ஐந்தாவது சீசனில் வெற்றி பெற்றார்.", "கல்யாணி நாயர்": "கல்யாணி நாயர் (Kalyani Nair) இந்தியாவின் சென்னையைச் சேர்ந்த ஓர் பாடகியாவார். இ இவர் முக்கியமாக தமிழ்த் திரையுலகில் பணி புரிகிறார். பள்ளி மாணவியாக இருக்கும்போதே, இவர் முதன்முதலில் கைரளி தொலைக்காட்சியில் சிம்பொனி என்ற நிகழ்ச்சியில் தோன்றினார்.மாசிலாமணி என்ற படத்தில் இவர் பாடிய  \"டோரா டோரா அன்பே டோரா \" என்ற பாடலும், பார்த்திபன் கனவு என்ற படத்தில் இடம் பெற்ற \"பக் பக் பக் ஹே மாடப்புறா\", தம்பி வெட்டோத்தி சுந்தரம் என்ற படத்தில் \"ஹே கொலைகாரா அனலாச்சு\" என்ற பாடலும், எம் மகன் படத்தின்\" குண்டு குண்டு கண்ணு\" பாடலும் மிகவும் பிரபலமானது.\nஇவர், கேரளாவின் திருவனந்தபுரத்தில் பிறந்தார். சென்னை எத்திராஜ் மகளிர் கல்லூரியில் பொருளாதாரத்தில் இளங்கலை பட்டம் பெற்றுள்ளார். பாடகர் ஹரிஹரன் ஒரு விழாவில் பாடியபோது இவருடைய குரலை பிரகாசமான எதிர்காலம் கொண்டதாக விவரித்தார்.", "கல்யாணி மேனன்": "கல்யாணி மேனன் (Kalyani Menon) (23 ஜூன் 1941 - 2 ஆகஸ்ட் 2021) ஓர் இந்திய பின்னணிப் பாடகி ஆவார். இவர் இந்தியத் திரைப்படத் துறையில் பணியாற்றினார். 1970களில் பாரம்பரிய பாடகியாக தொடங்கிய பிறகு, கல்யாணி திரைப்படத் துறையில் ஒரு பாடகியாக தன்னை நிறுவிக் கொண்டார். 1990களின் பிற்பகுதியிலும் 2000களின் முற்பகுதியிலும் ஏ.ஆர்.ரகுமானுடன் விரிவாகப் பல படங்களில் பணியாற்றினார். 2010இல் இவருக்கு கலைமாமணி விருது வழங்கப்பட்டது. மேலும் கேரள சங்கீத நாடக அகாதமி விருதையும் பெற்றுள்ளார்.", "கார்த்திக் (பாடகர்)": "கார்த்திக் (பிறப்பு 7 நவம்பர் 1980) சென்னையைச் சேர்ந்த தென்னிந்திய திரைப்படப் பாடகர். துவக்கத்தில் துணைப்பாடகராக ஏ.ஆர்.ரகுமானிடம் பணிபுரிந்த வந்த கார்த்திக் பின்னர் அவர் இசையமைப்பில் பல பாடல்களைப் பாடத் தொடங்கினார். பின்னர் பல இசையமைப்பாளர்களும் விரும்பும் பாடகராக தமிழ், இந்தி, தெலுங்கு, மலையாளம் மற்றும் கன்னடம் ஆகிய பல மொழிகளில் பாடியுள்ளார். \nபாய்ஸ் படத்தில் அவர் பாடிய \"எனக்கொரு கெர்ல்பிரண்ட் வேணுமடா\" என்ற பாடலும் கஜினியில் \"ஒரு மாலை\" பாடலும் பெருவெற்றி கண்டன. தெலுங்கு திரையுலகிலும்  கொத்தபங்காரு லோகம் மற்றும் ஹாப்பிடேஸ் படங்களில் அவரது பாடல்கள் பெரும் வரவேற்பைப் பெற்றன.வாரணம் ஆயிரம் படத்தில் அவர் கானா வகையில் பாடிய \"அவ என்ன\" என்ற பாடலும் பெரும் வரவேற்பைப் பெற்றுள்ளது. இந்தி மொழிமாற்றம் செய்து வெளியான கஜினி படத்தில் அவர் பாடிய \"பெக்கா\" பாடல் மூலம் உலகளவில் அறியப்பட்டார்.", "கார்த்திகேய மூர்த்தி": "கார்த்திகேய மூர்த்தி ஒரு இந்திய இசையமைப்பாளர், பாடகர்-பாடலாசிரியர் மற்றும் இசை தயாரிப்பாளர். தமிழ் / தெலுங்கு இருமொழி திரைப்படமான மூணே மூணு வார்த்தை / மூடு முக்கல்லோ செப்பலாண்டே (2015) திரைப்படத்தில் அறிமுகமானார்.(2015).", "கானா பாலா": "கானா பாலா  என்ற பெயரால் பெரிதும் அறியப்படும் பால முருகன்,  தமிழ்த் திரைப்படங்களில் புகழ்பெற்ற பின்னணிப் பாடகர் ஆவார். கானா பாடல்கள் என்ற இசைவகையில் மிகச் சிறந்த பாடலாசிரியராகவும் பாடகராகவும் விளங்குகிறார்.அட்டகத்தியில்  'ஆடி போனா ஆவணி', 'நடுக்கடலுல கப்பல' பாடல்கள் மூலம் பிரபலமானார். இசையமைப்பாளர் தேவாவிற்குப் பின்னதாக கானா பாடல்களை தமிழ் திரைப்படத்துறையில் மீள்வரவு செய்வதில் இவருக்கு முதன்மை இடம் உள்ளது. தமது சில கானா பாடல்களுக்கு இவரே பாடல் வரிகளையும் இயற்றி உள்ளார்.", "கிடாக்குழி மாரியம்மாள்": "கிடாக்குழி மாரியம்மாள், தமிழ்நாட்டின்  சிவகங்கை மாவட்டம், திருப்புவனம் வட்டம், திருப்புவனம்  ஊராட்சி ஒன்றியத்தில் உள்ள கிடாக்குழி எனும் கிராமத்தைச் சேர்நத நாட்டுப்புற பாடகர் ஆவார். இவர் சிறுவயது முதல் கோயில் திருவிழாக்கள், சடங்குகள் மற்றும் இறப்பு வீடுகளில் நாட்டுப்புற பாடல்களை பாடுபவர்.\nமாரி செல்வராஜ் இயக்கத்தில், சந்தோஷ் நாராயணன் இசையமைப்பில், தனுஷ் நடிப்பில் 9 ஏப்ரல் 2021ல் திரையரங்குகளில் வெளியாக உள்ள கர்ணன் எனும் திரைப்படத்திற்கு கண்டா வரச்சொல்லுங்க எனும் புகழ்பெற்ற நாட்டுப்புறப் பாடலை, கிடாக்குழி மாரியம்மாள் பாடியுள்ளார்.", "கிருஷ்ணசந்தர்": "கிருஷ்ணசந்தரன் (Krishnachandran) இந்தியத் திரைப்பட பின்னணிப் பாடகர், நடிகர் மற்றும் பின்னணிக் குரல் நடிகர் ஆவார்.", "கிருஷ்ணராஜ்": "கிருஷ்ணராஜ் தமிழ் திரைப்பட பின்னணிப் பாடகர் ஆவார்.இவர் \"வெள்ளரிக்கா பிஞ்சு வெள்ளரிக்கா\" பாடல் பாடினார். மேலும் பல பிரபலமான தமிழ்த் திரைப்பட பாடல்கள் பாடியுள்ளார். 1997 இல் பொற்காலம் தமிழ்த் திரைபடத்தின் \"தஞ்சாவூரு மண்ணு ௭டுத்து தாமிரபரணி தண்ணிய விட்டு\" பாடலுக்கு, சிறந்த பின்னணி திரைபடப் பாடகருக்கான தமிழ்நாடு அரசு விருது பெற்றார்.", "கிரேஸ் கருணாஸ்": "கிரேஸ் கருணாஸ் என்பவர் ஒரு இந்திய பின்னணிப் பாடகி மற்றும் நடிகை ஆவார். இவர் குறிப்பாக தமிழ்த் திரையுலகில் பணியாற்றியுள்ளார். நடிகர் கருணாசின் மனைவியான இவர்  தன் கணவர் நடித்த படங்களில் அடிக்கடி பாடியுள்ளார்.", "கே. ஜமுனா ராணி": "கே. ஜமுனா ராணி (K. Jamuna Rani, பிறப்பு: 17 மே 1938) தென்னிந்தியாவைச் சேர்ந்த திரைப்படப் பின்னணிப் பாடகி ஆவார். தெலுங்கு, தமிழ், கன்னடம், மலையாளம் மற்றும் சிங்கள மொழிகளில் 6,000இற்கும் அதிகமான திரைப்படப் பாடல்களை இவர் பாடியுள்ளார்.", "கே. ஜே. யேசுதாஸ்": "கட்டசேரி யோசஃப் யேசுதாஸ் (மலையாளம்: കാട്ടശ്ശേരി ജോസഫ് യേശുദാസ്) , (பிறப்பு 10 சனவரி 1940) அல்லது பரவலாக கே.ஜே.யேசுதாஸ், ஓர் இந்திய கருநாடக இசைக் கலைஞரும் புகழ்பெற்றத் திரைப்படப் பாடகரும் ஆவார். அவர் தமது 50 ஆண்டுகள் திரைவாழ்வில்  மலையாளம், தமிழ், இந்தி, கன்னடம், தெலுங்கு, வங்காள மொழி, குஜராத்தி, ஒரியா, மராத்தி, பஞ்சாபி, சமசுகிருதம், துளு, மலாய் மொழி, உருசிய மொழி,அராபிய மொழி, இலத்தீன், ஆங்கிலம் ஆகிய மொழிகளில் 40,000-க்கும் கூடுதலான திரைப்பாடல்களைப் பாடியுள்ளார். சிறந்த திரைப் பின்னணிப் பாடகர் வகையில் வேறு எந்தப் பாடகரும் சாதிக்காத நிலையில் எட்டு முறை தேசிய விருது பெற்றுள்ளார்.மாநில அளவில் கேரளம், தமிழ்நாடு, கர்நாடகம், ஆந்திரப்பிரதேசம் மற்றும் மேற்கு வங்க அரசுகளிடம் மொத்தம் 45 முறை சிறந்த திரைப்பாடகராக விருது பெற்றுள்ளார். திரையிசைத் தவிர,கருநாடக இசைக் கச்சேரிகள் பல நிகழ்த்தியுள்ளார். சமயப் பாடல்கள், பிற மெல்லிசைப்பாடல்கள் அடங்கிய இசைத்தொகுப்புகளையும் வழங்கியுள்ளார். மலையாளத் திரைப்படங்களுக்கு இசை இயக்குனராகவும் பணியாற்றியுள்ளார். இவரை கான கந்தர்வன் என்று இவரது இரசிகர்கள் அழைக்கின்றனர்.\nபிலிம்பேர் விருதுகள் தெற்கு ஐந்து முறை மற்றும் சிறந்த பின்னணிப் பாடகருக்கான நாற்பத்து மூன்று முறை மாநில விருது, மாநில அரசுகள் கொடுத்த விருதுகள் உட்பட கேரளா, தமிழ்நாடு, ஆந்திரா, கர்நாடகா, மற்றும் மேற்கு வங்கம்.  அவருக்கு 1975 இல் பத்மஸ்ரீ  , 2002 இல் பத்ம பூஷண் , மற்றும் 2017 ஆம் ஆண்டில் பத்ம விபூஷன் (இரண்டாவது மிக உயர்ந்த சிவில் விருது ) வழங்கப்பட்டது. கலைகளுக்கு அவர் செய்த பங்களிப்புகளுக்காக இந்திய அரசு .  2011 ஆம் ஆண்டில் இசைத் துறையில் அவர் செய்த பங்களிப்புகளுக்காக சிஎன்என்-ஐபிஎன் சிறந்த சாதனை விருதை யேசுதாசுக்கு வழங்கி கௌரவித்தது. 2006 ஆம் ஆண்டில் , சென்னையின் ஏ.வி.எம் ஸ்டுடியோவில் ஒரே நாளில் நான்கு தென்னிந்திய மொழிகளில் 16 திரைப்படப் பாடல்களைப் பாடினார் .  இந்த பாராட்டுகள் மற்றும் அங்கீகாரங்களின் விளைவாக, அவர் இந்திய இசை வரலாற்றில் மிகச் சிறந்த பாடகர்களில் ஒருவராக பரவலாகக் கருதப்படுகிறார் .", "கொல்லங்குடி கருப்பாயி": "கொல்லங்குடி கருப்பாயி, ஒரு தமிழ்ப் பாடகராவார். இவர் சிவகங்கை மாவட்டத்தில் மதுரை தொண்டி சாலையில் உள்ள கொல்லங்குடி என்னும் கிராமத்தைச் சேர்ந்தவர். பல நாட்டுப்புறப் பாடல்களைப் பாடிய இவர் தமிழ்த் திரைப்படங்களிலும் நடித்துள்ளார். தமிழ் நாட்டுப்புற இசையின் முன்னோடிகளில் ஒருவராகக் கருதப்படுகிறார். பின்னர் வந்த பிற இசைக் கலைஞர்களுக்கு உதாரணமாகத் திகழ்ந்தார். அனைத்திந்திய வானொலியில் நிகழ்கலை நிகழ்த்துனராகத் தன் பணியைத் தொடங்கிய இவர், அங்கு கிட்டத்தட்ட 30 ஆண்டுகள் பணியாற்றிய நிலையில் திரைப்படங்களில் நடிக்கத் தொடங்கினார். இவர் 1993இல் கலைமாமணி விருது பெற்றார்.", "கோவிந்த் வசந்தா": "கோவிந்த் வசந்தா (Govind Vasantha) (பிறப்பு: அக்டோபர் 29, 1988) ஓர் இந்திய இசையமைப்பாளரும், பாடகரும், வயலின் இசைக்கலைஞரும் ஆவார். இவர் மலையாளத் திரையுலகிலும், தமிழ்த் திரைப்படங்களிலும் முக்கியமாக பணியாற்றுகிறார்.  இவர் 'தாணிக்குடம் பிரிட்ஜ்' என்ற இசைக் குழுவை நிறுவி நடத்தி வருகிறார். அதில் இவர் ஓர் பாடகராகவும், வயலின் இசைக் கலைஞராகவும் இருக்கிறார்.  96 என்ற தமிழ் படத்தில் தனது பணிக்காக சிறந்த இசை இயக்குனருக்கான பிலிம்பேர் விருதை வென்றார்.", "சத்தியன் மகாலிங்கம்": "சத்யன் என்றறியப்படும் சத்தியன் மகாலிங்கம் ஓர் இந்தியத் திரைப்படப் பின்னணிப் பாடகர் மற்றும் இசையமைப்பாளர் ஆவார். வசூல்ராஜா எம்.பி.பி.எஸ் திரைப்படத்தில் இடம்பெற்ற கலக்கப்போவது யாரு பாடல், அறிந்தும் அறியாமலும் திரைப்படத்தில் இடம்பெற்ற சில் சில் என்ற பாடல், பாஸ் என்கிற பாஸ்கரன் திரைப்படத்தில் இடம்பெற்ற தலைப்புப் பாடல் போன்ற வெற்றிப் பாடல்களைப் பாடியதன் மூலமாக புகழ்பெற்றார்.", "சபேஷ் முரளி": "சபேஷ் - முரளி (ஆங்கிலம்:Sabesh-Murali) ஆகிய இருவரும் இந்திய இரட்டை இசையமைப்பாளர் ஆவர். இவர்கள் பின்னணிப் பாடல்களும் பாடியுள்ளனர்.", "சரண்யா சீனிவாசு": "சரண்யா சீனிவாசு (Sharanya Srinivas) (பிறப்பு 3 சனவரி 1991) ஒரு இந்திய பாடகராவார். இவர் தமிழ் படங்களில் பின்னணி பாடகராக பணியாற்றி வருகிறார். இவர் பிரபல பாடகர் சீனிவாசின் மகளாவார்.", "சாகுல் ஹமீது": "சாகுல் ஹமீது (Shahul Hameed, இறப்பு: 1998) தென்னிந்தியத் திரைப்படப் பின்னணிப் பாடகர். இவரது பாடல்கள் பெரும்பாலும் ஏ. ஆர். ரகுமான் இசைத்த தமிழ்த் திரைப்படங்களில் அமைந்துள்ளன. 1980களில் சாகுல் ஹமீது தொலைக்காட்சி நிகழ்ச்சிகளில் பாடல்களைப் பாடி வந்தார். 30க்கும் மேற்பட்ட பாடல்களை இசைத்தென்றல் மற்றும் சில நிகழ்ச்சிகளில் பாடியுள்ளார். இவர் 1989ல் ஏ. ஆர். ரகுமானுடன் இணைந்து தீன் இசை மழை என்ற இஸ்லாமிய இசைப் பாடல்களை பாடிப் புகழ் பெற்றார்.", "சாதனா சர்கம்": "சாதனா சர்கம் (பிறப்பு: மார்ச் 7, 1969) இந்தியத் திரைப்படப் பின்னணிப் பாடகி. இவர் சிறந்த பின்னணிப் பாடகிக்கான தேசிய விருது, மற்றும் பிலிம்பேர் விருது ஆகியவற்றைப் பெற்றவர். சாதனா சர்கம் ஹிந்தி, குஜராத்தி, வங்காளம், பஞ்சாபி, மற்றும் நேபாளம்  உட்பட மொத்தம் இருபத்தைந்து மொழிகளில் பாடி ஆகக்கூடுதலான மொழிகளில் பாடியவர் என்ற மதிப்பையும் பெற்றார்", "சாம் விசால்": "சாம் விசால் (Sam Vishal J.X.) (பிறப்பு: செப்டம்பர் 28, 1999) ஓர் இந்தியப் பின்னணி பாடகர் ஆவார். இவர் 2019ஆம் ஆண்டில், புன்யா செல்வாவுடன் இணைந்து சூப்பர் சிங்கர் 7 மெய் நிகழ்ச்சியில் 3வது இடத்தைப் பிடித்தார். இந்த நிகழ்ச்சியில் 3வது இடத்தைப் பிடித்ததற்காக, இசை அமைப்பாளர் அனிருத் ரவிச்சந்திரன் - 'சிட்டி ஸ்டோரி' மற்றும் 'புட்டா ஸ்டோரி' ('குட்டி ஸ்டோரி' இன் தெலுங்கு மற்றும் கன்னட பதிப்புகள்) பாடல்களைப் பாடுவதற்கான வாய்ப்பை இவருக்கு அளித்தார்.", "சாஷா திருப்பதி": "சாஷா திருப்பதி (Shashaa Tirupati) தேசிய விருது வென்ற திரைப்படப் பின்னணிப் பாடகி, பேச்சாளரும், நாடக நடிகருமாவார். இவர் இந்திய வம்சா வழியில் வந்த கனடா நாட்டவராவார். காசுமீரத்தைச் சேர்ந்த குடும்ப வழியில் வந்த இவர் பாலிவுட் மற்றும் தென்னிந்திய திரையிசைத் துறைகளில் பாடிவருகிறார்.\"தி ஹம்மா சாங்\" (ஓகே ஜானு திரைப்படம்)\", \"பிர் பி தும்கோ சாஹுன்கா\", \"பாரிஷ்\" (ஹால்ஃப் கேர்ள்பிரெண்டு திரைப்படம்) \"கன்ஹா\"  \"ஓ சோனா தேரே லியே\", \"சல் கஹின் டோர்\"  போன்றவை இவரது பிரபலமான பாடல்கள் ஆகும்.\nஇந்தி, தமிழ், தெலுங்கு, பஞ்சாபி, மலையாளம், கன்னடம், வங்காள மொழி, கொங்கணி மொழி, அரபு மொழி, ஆங்கிலம் ஆகிய மொழிகளில் இவர் பாடியுள்ளார். பாடகர் மட்டுமல்லாது கசூ, மேற்கத்திய கிதார், கிளபம்,ஆர்மோனியம் ஆகிய வாத்தியக் கருவிகளையும் வாசிக்கக் கூடியவர். காற்று வெளியிடை தமிழ் திரைப்படத்தில் இவர் பாடிய \"வான் வருவான்\" பாடலுக்கு 2018 ஆம் ஆண்டின் சிறந்த பின்னணிப் பாடகிக்கான தேசிய விருதினைப் பெற்றுள்ளார். உல்க்கா மயூர் எழுதி இயக்கிய \"ஐ கிளவுட்\" என்ற நாடகத்தில் முதன்முதலில் நடித்தார். இந் நாடகத்தின் கதாநாயகனாக பாடலாசிரியர் மயூர் பூரி நடித்துள்ளார்.", "சி. சத்யா": "சி. சத்யா (C.Sathya ) என்பவர் ஒரு தென்னிந்திய இசையமைப்பாளர் மற்றும் பின்னணி பாடகராவார். இவர் சில்லுனு ஒரு காதல்திரைப்பட இயக்குநரான கிருஷ்ணா இயக்கிய ’ஏன் இப்படி மயக்கினாய்’ படம் மூலம் இசையமைப்பாளராக 2009 இல் அறிமுகமானார். அந்தப் பாடப் பாடல்கள் வெளிவந்ததே தவிர, படம் வெளிவரவில்லை. இதன்பிறகு வெற்றிபெற்ற  தமிழ் திரைப்படமான எங்கேயும் எப்போதும் திரைப்படத்திற்கு இசையமைத்தார் அதன்பிறகு வெற்றிகரமாக பல படங்களுக்கு இசையமைத்தார். இவர் தெலுங்கு படமான சம்திங் சம்திங் படத்திற்கு இசையமைத்ததின் மூலம் புகழ்பெற்றார்.", "சித் ஸ்ரீராம்": "சித் ஸ்ரீராம்(Sid Sriram) (பிறப்பு 19 மே 1992) ஒரு இந்திய அமெரிக்க இசை உருவாக்குநர் மற்றும் பின்னணிப் பாடகர் ஆவார். இவர் பாடல்கள் எழுதுபவரும் கூட. தற்போது தமிழ் மற்றும் தெலுங்குத் திரைப்படத் துறையில் பின்னணிப் பாடகராகப் பணியாற்றி வருகிறார். வழக்கமாக, இவர் புகழ் பெற்ற பரதநாட்டியக் கலைஞர் பல்லவி ஸ்ரீராம் உடன் இணைந்து பணியாற்றி வந்தார்.", "சித்ரா": "சித்ரா அல்லது கே. எஸ். சித்ரா எனப் பொதுவாக அழைக்கப்படும் கிருஷ்ணன் நாயர் சாந்தகுமாரி சித்ரா (Krishnan Nair Shantakumari Chithra, பிறப்பு: 27 சூலை 1963), இந்தியத் திரைப்படப் பின்னணிப் பாடகி ஆவார். இவர் மலையாளம், கன்னடம், தமிழ், தெலுங்கு, ஒரியா, இந்தி, அசாமிய, வங்காளம் போன்ற பல இந்திய மொழிகளில் பாடி வருகிறார். இவர் ஆறு தடவைகள் இந்தியத் தேசிய திரைப்பட விருதுகளையும், ஆறு தடவைகள் தென்னிந்திய பிலிம்பேர் விருதுகளையும், மற்றும் பல்வேறு மாநில விருதுகளையும் பெற்றுள்ளார். இவர் தென்னிந்தியர்களிடையே \"இசைக்குயில்\"  எனவும் \"சின்னக்குயில்\" சித்ரா எனவும் பிரபலமாக அழைக்கப்படுகிறார். சனவரி 2021இல் இவருக்கு இந்தியாவின் குடிமை விருதுகளில் இரண்டாவது உயரிய விருதான பத்ம விபூசண் வழங்கப்படுவதாக அறிவிக்கப்பட்டது.", "சித்ரா ஐயர்": "சித்ரா ஐயர் (Chitra Iyer) எனக் குறிப்பிடப்படும் சித்ரா சிவராமன் ஓர்  இந்தியப் பின்னணிப் பாடகர் ஆவார். பெங்களூருவில் வசித்துவந்த சித்ரா, தமிழ் திரைப்படங்களில் 2000 ஆம் ஆண்டுகளின் ஆரம்பத்தில் ஏ.ஆர்.ரஹ்மானுடன் பரவலாகப் பணியாற்றி வந்தார், அதே நேரத்தில் மலையாள தொலைக்காட்சியில் ஒரு தொலைக்காட்சி தொகுப்பாளராகவும் நடிகையாகவும் பணியாற்றினார்.", "சிரேயா கோசல்": "சிரேயா கோசல் அல்லது சிரேயா கோஷல் (வங்காள: শ্রেয়া ঘোষাল; born 12 March 1984)  ஓர் இந்தியப் பாடகி. பல மொழித் திரைப்படங்களில் பின்னணிப் பாடல்கள் பாடியுள்ளார். நான்கு முறை தேசிய திரைப்பட விருதுகளையும், ஃபிலிம்பேர் விருதுகளையும் வென்றுள்ளார். இவர் தேவ்தாஸ் இந்தி படம் மூலம் 2002ஆம் ஆண்டு திரைப்பட உலகுக்கு அறிமுகமானார்.\n\n", "சிறிலேகா பார்த்தசாரதி": "சிறீலேகா பார்த்தசாரதி (Srilekha Parthasarathy) ஒரு தமிழ்ப் பாடகர் ஆவார். இவர் பொதுவாக சிறீலேகா என்ற முதல் பெயரால் குறிப்பிடப்படுகிறார். 2000 ஆம் ஆண்டில் நடிகை ஜோதிகா தோன்றிய \"இதயம் எண்ணெய்\" விளம்பரத்திற்கான சிறுபாடலைப் பதிவுசெய்து, இவர் தனது தொழில் வாழ்க்கையைத் தொடங்கினார். இப்பாடல் தமிழ் இசைத் துறையில் தனது நுழைவுச்சீட்டு என விவரிக்கிறார்.", "சிறீமதுமிதா": "சிறீமதுமிதா (Srimathumitha) இவர் பாரம்பரிய கருநாடக இசை மற்றும் திரைப்படப் பிண்ணனி பாடகராவார். பெரும்பான்மையாக இவர் தமிழ் மொழியில் அதிக பாடலகளைப்  பாடுகிறார். இவர் தெலுங்கு, இந்தி, கன்னட பாடல்களிலும் பாடியுள்ளார்.  இவரது சில வெற்றிப் பாடல்களில் ஒரு கல் ஒரு கண்ணாடி திரைப்படத்தின் \"அழகே அழகே\", அழகிய தமிழ் மகன் திரைப்படத்தின் \"வளையப்பட்டி தவிலே\", 7 ஜி ரெயின்போ காலனி திரைப்படத்தின் \"கனா கானும் காலங்கள்\" மற்றும் வேலாயுதம் திரைப்படத்தின் \"ரத்தத்தின் ரததமே\" போன்வை அடங்கும். இன்றைய திரைப்படப்  பின்னணி பாடகர்களில் இவரும் ஒருவராவார். இவர் இளையராஜா, ஹாரிஸ் ஜயராஜ், யுவன் சங்கர் ராஜா, ஏ. ஆர். ரகுமான், பரத்வாஜ், தேவா, எஸ். ஏ. ராஜ்குமார், மற்றும் பரணி போன்ற முன்னணி இசையமைப்பாளர்களின் பாடல்களுக்கு பாடியுள்ளார் . ராஜ் தொலைக்காட்சி நடத்திய  மெய்நிகர் தொடரான ராஜகீதத்தில் \"2002 இன் சிறந்த குரல்\" என்ற பெயரில் இவர் வெளிப்பட்டார். மறைந்த எழுத்தாளர் சுஜாதாவால் தேர்வு செய்யப்பட்ட 2004 ஆம் ஆண்டில் தொடங்கப்பட்ட விகடன் விருதுகளை வென்ற முதல் பின்னணி பாடகியும் இவராவார். ஏ. ஆர்.ரகுமானின் ஆஸ்கார் விருது பெற்ற சிலம்டாக் மில்லியனரின் ஒலிப்பதிவில் 2 பாடல்களில் இடம்பெற்றுள்ளார்.", "சின்மயி": "சின்மயி ஸ்ரீபதா (தெலுங்கு: చిన్మయి శ్రీపాద) (பிறப்பு: செப்டம்பர் 10, 1984) இந்தியாவைச் சேர்ந்த தமிழ்த் திரைப்படப் பின்னணி பாடகி ஆவார். ஏ. ஆர். ரகுமான் இசையமைப்பில் கன்னத்தில் முத்தமிட்டால் படத்தில் இடம்பெற்ற ஒரு தெய்வம் தந்த பூவே என்ற பாடல் இவர் பாடிய முதல் திரைப்படப் பாடலாகும். பின்பு எனக்கு உனக்கு, பாய்ஸ், அறிந்தும் அறியாமலும், சண்டக்கோழி போன்ற பல தமிழ் திரைப்படங்களில் பாடியுள்ளார்.\nசின்மயி, ஸ்டார் விஜய் தொலைக்காட்சியில் சூப்பர் சிங்கர் போட்டியைத் தொகுத்து வழங்கினார். மேலும் ஏர்டெல் சூப்பர் சிங்கர் ஜூனியர் மற்றும் ஏர்டெல் சூப்பர் சிங்கர் போன்ற நிகழ்ச்சிகளையும் தொகுத்து வழங்கினார். சென்னையில் ஒளிபரப்பாகும் ஆஹா பண்பலையில் திங்கள் முதல் சனிக்கிழமை வரை 'ஆஹா காப்பி க்ளப்' எனும் காலை ஏழு மணி முதல் பத்து மணி வரை நடைபெறும் வானொலி நிகழ்ச்சியின் தொகுப்பாளினியாகவும் இவர் இருக்கிறார். இவர் திரைப்படத்தில் பின்னணி குரல் தருபவராகவும் இருக்கிறார். சில்லுனு ஒரு காதல் படத்தில் பூமிகா சாவ்லாவிற்கு, உன்னாலே உன்னாலே படத்தில் தனிஷா முகெர்ஜிக்கு, சத்தம் போடாதே படத்தில் பத்மபிரியாவிற்கு, தாம் தூம் படத்தில் கங்கனா ரனாத்திற்கு, ஜெயம் கொண்டான் படத்தில் லேகா வாஷிங்டனிற்கு, சக்கரகட்டி படத்தில் வேதிகாவிற்கு மற்றும் வாரணம் ஆயிரம் படத்தில் சமீரா ரெட்டிக்கு என பல திரைப்படங்களில் கதாபாத்திரங்களுக்கு இவர் பின்னணிக் குரல் தந்துள்ளார்,\nஏ. ஆர். ரகுமான் இசையமைப்பில், மணிரத்னம் இயக்கத்தில், சிம்ரன் மற்றும் கீர்த்தனாவின் நடிப்பில் படத்தில் இடம்பெற்ற இவரது முதல் பாடல் வெற்றிப்பாடலாக அமைந்தது. சின்மயி, ஏ. ஆர். ரகுமானின் இசையமைப்பிலேயே நிறைய பாடல்களைப் பாடியுள்ளார். குரு படத்தின் தேரே பினா மற்றும் மையா மையா பாடல்களைப் பாடினார்.", "சின்னப்பொண்ணு": "சின்னபொண்ணு (Chinnaponnu) இந்தியாவின் தமிழ்நாடு மாநிலத்தைச் சேர்ந்த ஒரு நாட்டுப்புற இசைக்கலைஞர். இவர் சிவகங்கை மாவட்டத்தில் உள்ள கிராமம் ஒன்றில் பிறந்தவர்.\nதனது பதின்மூன்றாம் வயது முதலே கோயில்களிலும் தேவாலயங்களிலும் பாடத்துவங்கிய இவர் பின்னர் கோட்டைச்சாமி குழுவினருடன் இணைந்து பாடத்துவங்கினார். நாட்டுப்புற ஆய்வியலாளர் கே.ஏ. குணசேகரனின் உதவி தமிழ்நாட்டு மேடைகள் பலவற்றிலும் சின்னப்பொண்ணுவின் பாடலை ஒலிக்கச் செய்தது.\n2004 ஆம் ஆண்டில் இரஜினிகாந்த் நடித்த சந்திரமுகி படத்தில் இவர் பாடிய வாழ்த்துறேன் வாழ்த்துறேன் எனும் பாடல் இவர் திரைத்துறையில் அடியெடுத்து வைத்த நிகழ்வாகும். 2008 ஆம் ஆண்டில் காதலில் விழுந்தேன் படத்தில் இவர் பாடிய நாக்கு முக்கா பாடல் மிகவும் புகழ்பெற்றது.\n2011 ஆம் ஆண்டு ஜூன் மாதம் இவர் எம் டிவி கோக் ஸ்டுடியோ நிகழ்ச்சியில் கைலேஷ் கெர் உடன் இணைந்து பாடல்களைப் பாடினார்.", "சீர்காழி கோவிந்தராஜன்": "சீர்காழி எஸ்.கோவிந்தராஜன் (ஜனவரி 19, 1933 - மார்ச் 24, 1988) தமிழ் கருநாடக இசைப் பாடகரும், திரைப்படப் பின்னணிப் பாடகரும் ஆவார்.", "சுக்விந்தர் சிங்": "சுக்விந்தர் சிங் (Sukhwinder Singh) 1971 ஜூலை 18 அன்று பிறந்த ஒரு இந்திய பாலிவுட் பின்னணி பாடகர் ஆவார். 1998ஆம் ஆண்டு மணிரத்னத்தின் இயக்கத்தில் ஏ.ஆர்.ரஹ்மான் இசையமைத்து குல்சார் எழுதிய, தில் சே திரைப்டத்திலிருந்து \"சைய்யா சைய்யா\" என்ற பாடலுக்காக 1999 ஆம் ஆண்டு ஃபிலிம்ஃபேர் விருதுகளில் சிறந்த ஆண் பின்னணிப் பாடகருக்கான விருதை பெற்றவர். இந்த பாடலை சப்னா அவஸ்தியுடன் இணைந்து பாடியுள்ளார். சிங் பின்னர் ஸ்லம்டாக் மில்லியனர் திரைப்படத்தில் \"ஜெய் ஹோ\" பாடலில் சர்வதேச புகழ் பெற்றார், இது சிறந்த பாடலுக்கான அகாடமி விருது மற்றும் மோஷன் பிக்சர், தொலைக்காட்சி அல்லது பிற காட்சி ஊடகத்திற்கான சிறந்த பாடலுக்கான கிராமி விருது வென்றது. 2014 ஆம் ஆண்டில் வெளியான திரைப்படமான ஹைடர் திரைப்படத்திற்கான அவரது பங்களிப்பு அவருக்கு சிறந்த ஆண் பின்னணி பாடகருக்கான தேசிய திரைப்பட விருதைப் பெற்றுத் தந்தது .", "சுதா ரகுநாதன்": "சுதா ரகுநாதன் தமிழகத்தைச் சேர்ந்த கருநாடக இசைப் பாடகர். தமிழ்த் திரைப்படங்களிலும் பாடல்களைப் பாடி உள்ளார்.\nமூத்த எழுத்தாளர் அசோகமித்திரனின் தண்ணீர் என்கிற நாவல் 2015-ம் ஆண்டு வசந்தசாய் இயக்கத்தில் திரைப்படமாக எடுக்கப்படவிருக்கிறது. இந்த படத்திற்கு இசை அமைப்பதன் மூலம் இவர் தமிழ் திரைப்பட இசை அமைப்பாளராகவிருக்கிறார்.", "சுந்தர் சி. பாபு": "சுந்தர் சி பாபு (Sundar C. Babu) என்பவர் ஒரு இந்திய இசையமைப்பாளர் ஆவார்.   இவர் குறிப்பாக தமிழ், மலையாளம்,  தெலுங்கு மொழி படங்களுக்கு  இசையமைத்துவருகிறார். இவர் ஒரு பிரபலமான வீணை இசைக் கலைஞர் டாக்டர் சிட்டி பாபு மற்றும் சுதாக்சனா தேவி ஆகியோரின் மகன் ஆவார். இவரது சகோதரர்கள் ரங்கசாய் மற்றும் ராதாகிருஷ்ணன் ஆகியோராவர்.  இவர் தனது தந்தையின் வழிகாட்டுதலின் கீழ்,   2006 ஆம் ஆண்டில் மலையாள திரைப்படமான சாக்கோ ராண்டாமன் என்ற படத்திற்கு முதன்முதலில் இசையமைத்தார் தொடங்கினார்.  அதே ஆண்டில் சித்திரம் பேசுதடி படத்தின் மூலம் தமிழில் இசையமைப்பாளரகா  அறிமுகமாகி  புகழ் பெற்றார். \"வாள மீனுக்கும்\" பாடல் மக்களிடையே மிகவும் பிரபலமடைந்தது. அதன் பின்னர் இவர் பல்வேறு படங்களுக்கு இசையமைத்து வருகிறார். தெலுங்கு படங்களில் இவரது புகழ் சம்போ சிவ சம்போ மூலம் தொடங்கியது. இவர் ஆல்பா பள்ளியில் படித்தவர்", "சுர்முகி ராமன்": "சுர்முகி ராமன்  என அழைக்கப்படும் சுசித்ரா ராமன் (Surmukhi Raman) ஓர் இந்தியப் பின்னணிப் பாடகர் ஆவார். 1983 செப்டம்பர் 15 இல் தமிழ்நாட்டின் கோயம்புத்தூரில் பிறந்தவர். மகாராஷ்டிரா புனேயில் வளர்ந்தார்.  இவர் எப்போதாவது பாடல்களை எழுதுகிறார்.  இவர் தென்னிந்தியாவில் வளர்ந்து வரும் பின்னணிப்  பாடகர்களில் ஒருவராக உள்ளார்.  தமிழ் , தெலுங்கு , மலையாளம் மற்றும் கன்னடம் உள்ளிட்ட நான்கு மொழிகளில் 150 க்கும் மேற்பட்ட திரைப்படப் பாடல்களைப் பாடியுள்ளார். மேலும் பல பக்திப் பாடல்களைப் பதிவு செய்துள்ளார்.  அவர் இந்தியாவிலும் வெளிநாடுகளிலும் ஏராளமான  இசை நிகழ்ச்சிகளில் பங்கேற்றுள்ளார்.", "சுருதி ஹாசன்": "சுருதிஹாசன் (Shruti Haasan, பிறப்பு: சனவரி 28, 1986) பாடகர், இசையமைப்பாளர் மற்றும் திரைப்பட நடிகை என பல்வேறு துறைகளில் தன்னை வெளிப்படுத்தி வருகிறார். பிரபல தமிழ் நடிகர் கமல்ஹாசன் மற்றும் நடிகை சரிகா ஆகியோரின் மகள் ஆவார்.", "சுரேஷ் பீட்டர்ஸ்": "சுரேஷ் பீட்டர்ஸ் தென் இந்தியாவை சேர்ந்த இசை அமைப்பாளர் மற்றும் பின்னணி பாடகர் ஆவார். இசை அமைப்பாளர் ஏ. ஆர். ரகுமான் உடன் இணைந்து ஜென்டில்மன், காதலன், திருடா திருடா, இந்தியன், ஜீன்ஸ், சிவாஜி ஆகிய படங்களில் பாடி உள்ளார். பஞ்சாபி ஹவுஸ் என்ற மலையாள படம் மூலம் இசை அமைப்பாளராக அறிமுகம் ஆனார்.", "சுவர்ணலதா": "சுவர்ணலதா (Swarnalatha, ஏப்ரல் 29, \n1973 - செப்டம்பர் 12, 2010) தென்னிந்தியத் திரைப்படப் பின்னணிப் பாடகி ஆவார். 1987 ஆம் ஆண்டில் இருந்து பல இசையமைப்பாளர்களின் இசைக்குப் பின்னணிக் குரல் கொடுத்திருக்கிறார். \nஇவர் தமிழ், தெலுங்கு, கன்னடம், இந்தி, உருது, மலையாளம், பெங்காலி, ஒரியா, படுகா உள்ளிட்ட பல மொழிகளில் ஏழாயிரத்திற்கும் அதிகமான பாடல்களைப் பாடியுள்ளார்.     இவர்    \"ஸ்வரங்களின் அரசி\" எனவும்   \"இந்தியாவின் ஹம்மிங் குயின்\" என்றும் அழைக்கப்படுகிறார். \nகருத்தம்மா திரைப்படத்தில் இடம்பெற்ற போறாளே பொன்னுத்தாயி என்ற பாடலைப் பாடியதற்காக சிறந்த பாடகிக்கான இந்திய தேசிய விருது பெற்றவர். இப்பாடலை ஏ. ஆர். ரகுமான் இசையமைத்திருந்தார்.", "சுவேதா மோகன்": "சுவேதா மோகன் ஒரு இந்திய பாடகியாவார். இவர் 50-க்கும் மேற்பட்ட தமிழ், தெலுங்கு, மலையாளம், கன்னடம், இந்தி மொழித் திரைப்படங்களில் பாடியுள்ளார். இவர் பாடகி சுஜாதா மோகனின் மகள்.\n\n", "சுனந்தா (பாடகி)": "சுனந்தா (Sunanda) ஒரு இந்திய திரைப்பட பின்னணி பாடகி ஆவார், அவர் முக்கியமாக தமிழ் மற்றும் மலையாள திரைப்படங்களில் பணியாற்றுகிறார். 1983 இல் சென்னைக்குச் செல்வதற்கு முன் கேரளாவில் தனது முதல் பட்டப்படிப்பை முடித்தார். கர்நாடக இசையில் பயிற்சி பெற்றார். தென்னிந்திய திரைப்பட இசையமைப்பாளர் இளையராஜாவுக்கு அறிமுகமானார், அவர் புதுமைப்பெண் திரைப்படத்தில் தனது முதல் பாடலை வழங்கினார்.", "சுனிதா சாரதி": "சுனிதா சாரதி (Sunitha Sarathy) இந்திய சமகால மற்றும் மேற்கத்திய பாரம்பரிய இசை வகைகளில் பாடும் ஒரு இந்திய பாடகி மற்றும் நடிகர் ஆவார்.  அவர் பல்வேறு தேவாலயக் குழுவில் பாடும் ஒரு சுவிசேஷ பாடகர் ஆவார்.  2000 ஆம் ஆண்டில் சேனல் வி மற்றும் விர்ஜின் ரெகார்ட்ஸின் கூட்டு முயற்சியான \"விர்ஜின் வாய்ஸ் சாய்ஸ்\" போட்டியை வென்ற பிறகு, 2002 ஆம் ஆண்டில் மீண்டும் திரைப்படப் பாடல்களை பாட ஆரம்பித்தார்.\nதமிழ் திரைப்படமான ஏய் நீ ரொம்ப அழகாய் இருக்கே என்ற படத்தில் பின்னணி பாடகராக அறிமுகமானார். முன்னணி பாடகர்களான  ஸ்ரீனிவாஸ் மற்றும் சுஜாதா மோகன் ஆகியோருடன் \"இனி நானும் நானில்லை'' என்ற பாடலில் முன்னோடி மற்றும் இடைவேளையின் பகுதிகளில் பாடினார். சாரதி  200 க்கும் மேற்பட்ட திரைப்படப் பாடல்களை பாடியுளார்.", "சுஜாதா மோகன்": "சுஜாதா மோகன் (பிறப்பு: மார்ச்சு 31, 1964) ஒரு தென்னிந்தியத் திரைப்படப் பின்னணிப் பாடகி. இவர் தமிழ், தெலுங்கு, கன்னடம், மலையாளம், இந்தி மொழித் திரைப்படங்களில் ஏறத்தாழ 4000 பாடல்கள் பாடியுள்ளார். மேலும் இவர் பல விருதுகளும் பெற்றுள்ளார்.", "சூலமங்கலம் சகோதரிகள்": "இசைத்துறையில் சூலமங்கலம் சகோதரிகள் (Soolamangalam Sisters) என அழைக்கப்படும் ஜெயலட்சுமி, ராஜலட்சுமி ஆகிய இருவரும்  பக்திப் பாடல்களுக்குப் புகழ்பெற்ற சகோதரிகள். கர்நாடக இசையிலும் பக்திப்பாடல்களிலும் புகழ்பெற்று விளங்கிய பல இரட்டையருக்கு (ராதா-ஜெயலட்சுமி, பாம்பே சகோதரிகள், ரஞ்சனி-காயத்ரி, பிரியா சகோதரிகள்) இவர்கள் முன்னோடியாக விளங்கினர்.", "சைந்தவி (பாடகி)": "சைந்தவி (பிறப்பு 3 சனவரி 1989) ஒரு கருநாடக இசைப்பாடகியும் தென்னிந்திய திரையிசைப் பாடகியும் ஆவார். இவர் தனது 12-ஆவது வயது முதல் பாடி வருகின்றார். இவருக்கும் இசையமைப்பாளர் ஜி. வி. பிரகாசுக்கும் 27 சூன் 2013 இல் சென்னையில் திருமணம் நடந்தது.", "சோபனா விக்னேஷ்": "முனைவர் சோபனா விக்னேஷ் கருநாடக சங்கீத பாடகர். இவர் பெரும்பாலும் தெய்வீக பாடல்களைப் பாடுபவர். மகாநதி திரைப்படத்தில் நடித்ததால் இவர் 'மகாநதி' சோபனா என்றும் அறிப்படுகிறார்.", "சௌம்யா ராவ்": "சௌமியா ராவ் (Sowmya Raoh) கன்னடம், தமிழ், இந்தி, தெலுங்கு ஆகிய மொழிகளில் பாடி வரும் இந்திய பின்னணி பாடகியாவார்.", "டி. எம். சௌந்தரராஜன்": "டி. எம். சௌந்தரராஜன் (T. M. Soundararajan, மார்ச் 24, 1922 - மே 25, 2013) தமிழ்த் திரைப்படப் பின்னணிப் பாடகர். 2003இல் பத்மசிறீ விருதைப் பெற்ற சௌந்தரராஜன் நாற்பது ஆண்டுகள் தமிழ்த் திரைப்படங்களில் பாடினார். இவர் திரைப்பட பாடல்கள் மட்டுமின்றி பல பக்தி பாடல்களையும் பாடினார். \n\n", "டி. எல். மகராஜன்": "டி. எல். மகராஜன் (பிறப்பு: 9 மார்ச் 1954) தமிழகத்தைச் சேர்ந்த தமிழ்த் திரைப்பட பின்னணிப் பாடகர்.", "டி. எஸ். பகவதி": "டி. எஸ். பகவதி என அழைக்கப்பட்ட தென்காசி சீனிவாச பகவதி (பிறப்பு: 1925) தமிழ்த் திரையிசைப் பின்னணிப் பாடகியும், வானொலிப் பாடகரும் ஆவார். பராசக்தி, இரத்தக்கண்ணீர், சிவகங்கை சீமை போன்ற பல திரைப்படங்களில் பாடல்களைப் பாடியுள்ளார்.", "டி. கே. எஸ். நடராஜன்": "டிகேஎஸ். நடராஜன் (23 சூலை 1933 – 5 மே 2021) என்பவர் தமிழகத் திரைப்பட நடிகர் மற்றும் தெம்மாங்கு பாடகர் ஆவார். தமிழ் நாடகத்துறையில் புகழ்வாய்ந்த டிகேஎஸ் கலைக்குழுவில், இவர் சிறுவனாக இருந்தபோது சேர்ந்து நடித்ததால் நடராஜன் என்ற இவரது பெயருக்கு முன்னாள் டிகேஎஸ் என்ற அடைமொழியோடு டிகேஎஸ். நடராஜன் என அழைக்கப்படுகிறார்.", "டி. கே. கலா": "டி. கே. கலா (T. K. Kala) என்பவர் ஒரு இந்திய பின்னணி பாடகர் ஆவார். இவர் தமிழ், கன்னடம், தெலுங்கு மொழிகளில் பாடுகிறார். தமிழ் படங்கள் துணைப் பாத்திரங்களிலும், பின்னணி குரல்  நடிகையாகவும் உள்ளார்.  இவர் 2006 இல் கலைமாமணி விருதைப் பெற்றார்.  இவர் நடிகை சண்முகசுந்தரியின் மகளாவார்.", "டி. வி. ரத்தினம்": "டி. வி. ரத்தினம் (T. V. Rathinam, பிறப்பு: 1929) 1940களிலும், 50களிலும் பிரபலமான ஒரு தமிழ்த் திரைப்படப் பின்னணி, கருநாடக இசைப் பாடகி ஆவார்.", "தரண் குமார்": "தரண்குமார் (பிறப்பு 8 அக்டோபர் 1983) என்பவர் ஒரு இந்திய இசையமைப்பாளர் ஆவார். இவர் முதன்மையாக தமிழ் திரையுலகில் திரைப்பட பாடல்களுக்கான இசையையும்,  பின்னணி இசையையும் அமைத்துள்ளார். இவர்  பாரிஜாதம் படத்தின் வழியாக அறிமுகமானார். இயக்குனரும் நடிகருமான கே. பாகியராஜை இவர் தன் குருவாகப் பாராட்டுகிறார்.", "தன்வி ஷா": "தன்வி ஷா (Tanvishah)கிராமி விருதை வென்ற முதல் இந்தியப் பெண் பாடகி ஆவார். இவர் தமிழ், இந்தி மற்றும் தெலுங்கில் பாடியுள்ளார்.  கூடுதலாக, அவர் ஸ்பானிஷ் , போர்த்துகீசியம் , மற்றும் பிற ரோமானிய மொழிகளிலும் , அரபு மொழியிலும் பாடுகிறார்.  அவரது \"ஃபனா\"என்ற முதல் பாடல் யுவா  படத்தில் இடம் பெற்றது.", "தனுஷ் (நடிகர்)": "தனுஷ் (Dhanush, பிறப்பு: 28 சூலை 1983) என்பவர் தமிழ்நாட்டுத் திரைப்பட நடிகர், திரைப்படத் தயாரிப்பாளர், பின்னணிப் பாடகர், திரைப்படப் பாடலாசிரியர், திரைக்கதை ஆசிரியர் மற்றும் திரைப்பட இயக்குனர் ஆவார். இவர் 2002 ஆம் ஆண்டு முதல் திருடா திருடி (2003), சுள்ளான் (2004), புதுப்பேட்டை (2006), பொல்லாதவன் (2007), ஆடுகளம் (2011), 3 (2012), வேலையில்லா பட்டதாரி (2014), மாரி (2015), அசுரன் (2019) போன்ற பல தமிழ் மொழி திரைப்படங்களிலும்  மற்றும் ராஞ்சனா (2013) போன்ற இந்தி திரைப்படங்களிலும் நடித்ததன் மூலம் தமிழ்த் திரையுலகின் முன்னணி நடிகர்களில் ஒருவராவார்.இவர் 40 மேலான திரைப்படங்களில் நடித்ததன் மூலம் 14 தென்னிந்திய சர்வதேசத் திரைப்பட விருதுகள், 9 விஜய் விருதுகள், 7 தென்னிந்திய பிலிம்பேர் விருதுகள், 5 விகடன் விருதுகள், 5 எடிசன் விருதுகள், 4 தேசிய திரைப்பட விருதுகள்  மற்றும் பிலிம்பேர் விருதுகள் போன்றவை வென்றுள்ளார். இந்திய பிரபலங்களின் வருவாயை அடிப்படையாகக் கொண்ட ஃபோர்ப்ஸ் இந்தியா பிரபலங்கள் 100 பட்டியலில் தனுஷ் ஆறு முறை சேர்க்கப்பட்டுள்ளார் என்பது குறிப்பிடத்தக்கது.தனுஷ் தனது வுண்டர்பார் பிலிம்ஸ் மூலமாக படம் தயாரிக்கிறார். இவருக்கு சிறந்த நடிகர் விருது மட்டுமல்லாமல் இவருடைய தயாரிப்பில் வெளிவந்த விசாரனை படத்திற்கு தேசிய விருதும் வழங்கப்பட்டது.", "திப்பு": "திப்பு தமிழ், கன்னடம், மலையாளம், தெலுங்கு மொழிகளில் பாடும் ஒரு தென்னிந்திய திரைப்படப்பாடகர். இவரது இயற்பெயர் ஏகாம்பரேஷ் என ஓர் தொலைக்காட்சி நிகழ்ச்சியில் (காபி வித் அனு) கூறியுள்ளார். பின்னணிப் பாடகி ஹரிணியை மணம் புரிந்துள்ளார். சாய் ஸ்மிரிதி என்ற மகளும் சாய் பிரத்யங்கர் என்ற மகனும் உள்ளனர்.", "திருவுடையான்": "திருவுடையான் என்பவர் தமிழ்நாடு முற்போக்கு எழுத்தாளர் சங்கத்தின் திருநெல்வேலி மாவட்டச் செயலராகவும், பொதுவுடமைக் கட்சியின் கொள்கை விளக்கப் பாடகராகவும் இருந்தவர். இவர் சில திரைப்படங்களுக்கும் பாடல்கள் பாடியுள்ளார்.", "திலிப் வர்மன்": "திலிப் வர்மன் ஓரு மலேசியப் பாடகர். இவர் பாடலாசிரியரும் இசையமைப்பாளரும் ஆவார். இவர் மலேசியாவின் பினாங்கு மாநிலத்தில் பிறந்து வளர்ந்தவர். இந்தியப் பின்னணிப் பாடகர்களுடன் ஒப்பிடப்படும் மலேசியத் தமிழ்ப் பாடகரான இவர், தமிழ் இசையமப்பாளர்களான இளையராஜாவுக்கும், ஏ.ஆர்.ரகுமானுக்கும் ரசிகராவார். தனது இசைப் பயணத்தை சிறு மேடை நிகழ்ச்சிகளின் வாயிலாகத் தொடங்கிய திலிப் வர்மனின் பாடல்களில் கனவெல்லாம் நீதானே  என்ற பாடல் மிகப் புகழ் பெற்றதாகும்.\nமலேசியத் தமிழ்த் திரைப்படங்களான நவம்பர் 24, கண்கள், இவன்தான் ஹீரோ ஆகிய படங்களுக்கு இசையமைத்துள்ளார். 2007 ஆம் ஆண்டிற்கான மலேசிய இந்திய இசைத் துறை வழங்கிய சிறந்த ஆண் பாடகருக்கான விருதினைப் பெற்றுள்ளார்.முன்னாள் மலேசிய அமைச்சர் டத்தோ சிறீ சாமிவேலுவும் இவரது ”கனவுகள் வரும்” பாடல்தொகுப்பிற்கு ஓர் பாடல் எழுதியுள்ளார்.\n2002 ஆம் ஆண்டில்தான் இவரது திறமை அங்கீகரிக்கப்பட்டது எனலாம். ”நவீனம்” என்னும் பாடல்தொகுப்பில் பாடும் வாய்ப்பைப் பெற்றர்.\nதிலிப் தனது ”உயிரைத் தொட்டேன்” என்னும் பாடலின் மூலம் மேலும் புகழ் பெற்றார். இந்த பாடலின் சிறந்த இசையின் காரணமாகவும், தரத்தினாலும் ”டி.ஹெச்.ஆர் ராகா மலேசியன் டாப் 10” என்ற நிகழ்ச்சியில் நீண்ட நாட்களாக ஒலிபரப்பப்பட்டது.\nமாபெரும் வெற்றிபெற்ற ”கனவெல்லாம்” என்னும் இசைக்கோவைக்குப் பிறகு ”மீண்டும் மீண்டும்” என்னும் இசைக்கோவையைத் துவங்கினார். இந்த இசைக்கோவையை இந்தியப் பாடகருடன் இந்தியாவில் பாடியுள்ளார்.", "தினா (இசையமைப்பாளர்)": "தினா (தமிழ்: தினா; என்பவர் ஒரு இந்திய திரைப்பட இசை அமைத்துள்ளார் ஆவார். இவர் 1966 ஜனவரி 15 இல் பிறந்தார்.\nஜி. கே. வெங்கடேசு, இளையராஜா போன்றவர்களிடம் பணியாற்றினார்.\nசித்தி, அண்ணாமலை, நினைவுகள், பயணம், நம்பிக்கை, செல்லமே, மெட்டி ஒலி போன்ற தொலைக்காட்சி தொடர்களுக்கு இசை அமைத்துள்ளார்.‌\nராதிகா சரத்குமார் நடித்து தயாரித்து சித்தி தொடர் தினாவுக்கு பெரிய புகழ் கிடைத்தது.2001 இல் மிடில் கிளாஸ் மாதவன் திரைப்படத்திற்கு இசையமைத்தார். பின்பு தெலுங்கு, கன்னட திரைப்படங்களில் இசையமைத்துள்ளார்.", "தீ (பாடகி)": "தீட்சிதா வெங்கடேசன் (26 சூன் 1998) என்பவர் தீ என்று அழைக்கப்படும் ஆஸ்திரேலிய நாட்டு தமிழ் பின்னணிப் பாடகி ஆவார். இவர் 2013 ஆம் ஆண்டு முதல் தமிழ் திரைப்படத்துறையில் பல பாடல்கள் பாடுகிறார். 2014ஆம் ஆண்டு வெளியான மெட்ராஸ் என்ற திரைப்படத்தில் 'நான் நீ' என்ற பாடலை பாடியதற்காக சிறந்த பின்னணிப் பாடகிக்கான பிலிம்பேர் விருது – தமிழ் மற்றும் விஜய் விருதுகள் சிறந்த பெண் பின்னணி பாடகி போன்ற விருதுகளுக்கு பரிந்துரை செய்யப்பட்டார்.", "தீபன் சக்ரவர்த்தி": "தீபன் சக்ரவர்த்தி இந்திய திரைப்படப் பின்னணி பாடகர் ஆவார். இவர் தமிழ் திரையுலகின் முதல் பின்னணிப் பாடகரான இசைத் தென்றல் திருச்சி லோகநாதனின் மகனாவார்.", "தீபா மிரியம்": "தீபா மிரியம் (Deepa Miriam) தென்னிந்திய திரைப்பட பின்னணிப் பாடகி ஆவார். இவர் நான் அவனில்லை  திரைப்படத்தின் மூலம் அறிமுகம் செய்யப்பட்டார். சுப்பிரமணியபுரம்  திரைப்படத்தில் இவர் பாடிய கண்கள் இரண்டால் பாடல் மூலம் பிரபலமானவர்.", "தெ. இரா. மகாலிங்கம்": "தென்கரை இராமகிருஷ்ணன் மகாலிங்கம் அல்லது பொதுவாக டி. ஆர். மகாலிங்கம் (16 சூன் 1924 - 21 ஏப்ரல் 1978) 1940 – 1950களில் பிரபலமாயிருந்த ஒரு தமிழ்த் திரைப்பட நடிகர், பாடகர், திரைப்படத் தயாரிப்பாளர் மற்றும் இசையமைப்பாளர் ஆவார். உச்சத்தொனியில் பாடும் திறமை பெற்ற இவரின் காதல் மற்றும் பக்திப்பாடல்கள் இவருக்குப் பெயர் வாங்கித் தந்தன.", "தேவன் ஏகாம்பரம்": "தேவன் ஏகாம்பரம் (Devan Ekambaram) (பிறப்பு 1975 திசம்பர் 25) ஒரு இந்திய அமெரிக்க திரைப்பட பின்னணி பாடகரும், நடிகரும், இசையமைப்பாளரும் ஆவார். தமிழ்ப் படங்களில் பின்னணி பாடகராக தனது வாழ்க்கையைத் தொடங்கிய இவர் பின்னர் தெலுங்கு, கன்னடம் போன்ற பல தென்னிந்திய மொழிகளிலும் 500க்கும் மேற்பட்ட படங்களுக்கு பாடியுள்ளார்.", "தேனி குஞ்சரமாள்": "தேனி குஞ்சரமாள்  என்பவர் தமிழ் திரைப்பட நடிகை மற்றும் பின்னணிப் பாடகர் ஆவார். 1990 கள் மற்றும் 2000 கள் ஆகியவற்றில் ஏ. ஆர். ரகுமான் இசையில் பின்னனி பாடகியாக பணியாற்றினார். இவர் ஹாரிஸ் ஜயராஜ் இசையிலும் பணியாற்றினார்.\nகருத்தம்மா (1994) திரைப்படத்தில் பெண் குழந்தைகளுக்கு கள்ளிப்பால் கொடுத்து கொல்கிறார். இந்தக் கதாப்பாத்திரத்தின் மூலம் அறியப்படுகிறார். நகைச்சுவை நடிகர் விவேக் அவர்கள் காதல் சடுகுடு (திரைப்படம்) (2003) திரைப்படத்தில் குஞ்சரமாளுடன் நடித்தர்.ஏ. ஆர். ரகுமான் இசையில் காதலன் (திரைப்படம்) (1994), முத்து (1995), தாஜ்மகால் (1999) and சில்லுனு ஒரு காதல் (திரைப்படம்) (2006) போன்ற திரைப்படங்களில் பாடல் பாடியுள்ளார்.இளையராஜா இசையில் விருமாண்டி (2004) மற்றும் ஹாரிஸ் ஜயராஜ் இசையில் அருள் (திரைப்படம்) (2004) போன்ற திரைப்படங்களில் பாடியுள்ளார்.", "நரேஷ் ஐயர்": "நரேஷ் ஐயர் (Naresh Iyer) சனவரி 3, 1981 ) இந்தியத் திரைப்படப் பாடகர் ஆவார். நரேஷ் ஐயர் பல இந்திய மொழிகளில் திரைப்பட பாடல்களை பாடியுள்ளார். 2006iஇல் ஏ.ஆர்.ரஹ்மான் இசையமைத்த ரங் தே பசந்தி என்றத் திரைப்படத்தில் இருந்து \"ரூபாரூ\" என்ற படத்தில் பாடிய பாடல் பல வாரங்களுக்கு இசை வரிசையில் முதலிடம் பிடித்து ,இவருக்கு சிறந்த ஆண் பின்னணி பாடகருக்கான தேசிய திரைப்பட விருதை பெற்றுத் தந்தது.  ஆர்.டி. பர்மன் இசை திறமை பிரிவிலும் பிலிம்பேர் விருது பெற்றார். அறிமுக ஆண்டுகளில் பிலிம்பேர் விருது மற்றும் தேசிய விருதை பெற்ற ஒருசில  பின்னணி பாடகர்களில் இவரும் ஒருவர் ஆவார்.", "நாகூர் அனிபா": "நாகூர் இ. எம். ஹனீஃபா (Nagore E. M. Hanifa) என அழைக்கப்படும் நாகூர் இஸ்மாயீல் முஹம்மத் ஹனீஃபா (25 டிசம்பர் 1925 - 8 ஏப்ரல் 2015) தமிழக அரசியல்வாதி மற்றும் பிரபல இஸ்லாமியப் பாடகரும் ஆவார். திராவிடக் கொள்கையில் பற்றுக் கொண்ட இவர், திராவிட முன்னேற்றக் கழகத்தின் ஆரம்ப காலம் முதல் இறுதி வரை முக்கிய பங்கு வகித்தார். இவர் \"இசை முரசு\" என்றும் அழைக்கப்படுகின்றார்.", "நித்யஸ்ரீ மகாதேவன்": "நித்யஸ்ரீ மகாதேவன் (Nithyasree Mahadevan) ஒரு புகழ்பெற்ற கர்நாடக இசைப் பாடகி. டி. கே. பட்டம்மாள் பேத்தி என்பது குறிப்பிடத்தக்கது\nடி.கே.பட்டம்மாளின் மகன்கள் சிவகுமார் மற்றும் லட்சுமணன் ஆவர். சிவகுமாரின் மகள், நித்யஸ்ரீ மகாதேவன் ஆவார். நித்யஸ்ரீயின் சகோதரியின் மகளாகிய லாவண்யா சுந்தரராமன், வளர்ந்துவரும் இளம் இசைக் கலைஞர் ஆவார்.", "நேகா பாசின்": "நேகா பாசின் (Neha Bhasin, பிறப்பு:நவம்பர் 18, 1982, தில்லி ) ஒர் இந்தியப் பாடகரும் பாடலாசிரியரும்  ஆவார். தொலைக்காட்சித் தொகுப்பாளராகவும் நிகழ்கலை நிகழ்த்துனராகவும் பணியாற்றுகிறார். இவர் பஞ்சாபியைத் தாய்மொழியாகக் கொண்டவர். தன் சிறு வயது பள்ளிப் படிப்பையும் மேற்படிப்பையும் புது தில்லியிலேயே மேற்கொண்டார். எப்பொழுதும் இசையைப் பற்றியும், கலையைப் பற்றிய சிந்தனையைக் கொண்டிருந்தார். இதனால் சிறு வயதிலேயே பல போட்டிகளில் கலந்து கொண்டார்.இந்தியப் பெண்கள் பாப்பிசைக் குழுவான வீவா!வில் பங்கேற்றுள்ளார்.", "பத்மலதா": "பத்மலதா என்பவர் இந்திய பின்னணி பாடகர் ஆவார். இவர் தமிழ்நாட்டின் சென்னையில் பிறந்தார். தனி ஒருவன் திரைப்படத்தின் \"கண்ணாலே கண்ணாலே\" பாடல் தொகுப்பு வெளியாகி தரவரிசையில் முதலிடத்தைப் பிடித்த பிறகு இவர் புகழ் பெற்றார்.  இவர் தமிழில்  \"கண்ணாலை கண்ணாலே\" மற்றும் \"காதலே காதலே\" போன்ற பாடல்களுக்காவும், தெலுங்கில்  \"பரேஷானுரா\", \"சூசா சூசா\", \"சாலி காலி சூடுடு\" மற்றும் \"காந்தாரி யாரோ\" ஆகிய பாடங்களுக்காக அறியப்படுகிறார்.", "பரவை முனியம்மா": "பரவை முனியம்மா (Paravai Muniyamma, 25 சூன் 1943 - 29 மார்ச் 2020) என்பவர் தமிழ்த் திரைப்பட, நாட்டுப்புறப் பாடகி, மற்றும் நடிகையாவார். இவர் மதுரை மாவட்டத்திலுள்ள, பரவை எனும் ஊரைச் சேர்ந்தவர் என்பதால் பரவை முனியம்மா என்று அழைக்கப்பட்டார்.", "பவதாரிணி": "பவதாரிணி (Bhavatharini) தமிழ்த் திரைப்பட இசையமைப்பாளரும் பாடகரும் ஆவார். இவர் இசையமைப்பாளர் இளையராசாவின் மகள் ஆவார். இவருடைய உடன்பிறப்புகளான கார்த்திக்கு இராசா, யுவன் சங்கர் இராசா ஆகியோரும் இசையமைப்பாளர்கள் ஆவர்.இளையராசாவின் இசையில் பாரதி திரைப்படத்தில் அமையும் மயில் போலப் பொண்ணு ஒன்னு என்ற இவர் பாடிய பாடல் இவருக்குச் சிறந்த பின்னணிப் பாடகருக்கான தேசிய விருதைப் பெற்று தந்தது.", "பாப் ஷாலினி": "பாப் ஷாலினி என பிரபலமாக அழைக்கப்படும் ஷாலினி சிங் , இந்தியாவிலுள்ள தமிழ்நாட்டின் பாடகர் ஆவார்.  ஷாலினி என்ற ஒரு இசைட்தொகுப்பை அவர்தனது பதின்மூன்றாம் வயதிலேயே வெளியிட்டார்.  அவர் இந்திய திரைப்படங்கள் மற்றும் இசைத் தொகுப்புகளுக்கான பல்வேறு இந்திய மொழிகளில் 5000 க்கும் மேற்பட்ட பாடல்களைப்  பாடினார்.  ஏ. ஆர். ரகுமான்  , ஹாரிஸ் ஜெயராஜ் , இளையராஜா , யுவன் ஷங்கர் ராஜா , வித்யாசாகர் மற்றும் பலரின் இசையில் பாடியுள்ளார்.\nஷாலின் ஒரு பாடகர், நடிகர், பதிவர் மற்றும் எழுத்தாளர் ஆவார். அவர் 1984 இல் பிறந்தார். அவர் தின்செல் ரங்கி தயாரிப்பு  நிறுவனத்தின் முதன்மை அதிகாரி ஆவார்.  அவர் பாலாஜி என்பவரைத்  திருமணம் செய்து கொண்டார், அவருக்கு ஆதித்யா என்கிற மகன் இருக்கிறார். தற்போது அவர் சென்னையில் வசிக்கிறார்.  அவரது கணவர் ஸ்வீடன் சார்ந்த நிறுவனத்தில் பொது மேலாளராகப் பணியாற்றுகிறார்.", "பாம்பே ஜெயஸ்ரீ": "பாம்பே ஜெயஸ்ரீ எனப் பரவலாக அறியப்படும் ஜெயஸ்ரீ இராம்நாத் ஒரு புகழ்பெற்ற கருநாடக இசைப் பாடகி. இவர் தென்னிந்தியத் திரைப்படங்களில் முன்னணி இசையமைப்பாளர்களான ஹாரிஸ் ஜெயராஜ், இளையராஜா, ஏ. ஆர். ரகுமான், வித்யாசாகர், யுவன் சங்கர் ராஜா  இசையமைப்பில் பல வெற்றித் திரைப்பாடல்களைப் பாடியுள்ளார். \nஅவர் வயலின் வாத்தியக்கலைஞர் லால்குடி ஜெயராமனின் சீடர் ஆவார்.", "பாலக்காடு சிறீராம்": "பாலக்காடு ஸ்ரீராம் (Palakkad Sreeram, பிறப்பு: 16, பிப்ரவரி, 1972) என்பவர் ஒரு இந்திய திரைப்பட பாடகர் ஆவார். இவர் குறிப்பாக தமிழ் திரையுலகில் பணியாற்றுகிறார். படையப்பாவில் வெற்றிக் கொடி கட்டு, ஸ்லம்டாக் மில்லியனரில் லிக்விட் டேன்ஸ்சும் இவரது குறிப்பிடத்தக்க படைப்புகள் ஆகும்.", "பி. ௭ஸ். சசிரேகா": "சசிரேகா (Sasirekha) தமிழ் திரைப்பட பின்னணிப் பாடகி ஆவார். பொண்ணுக்குத் தங்க மனசு (1973) என்ற திரைப்படத்தில் \"தஞ்சாவூரு சீமையிலே கண்ணு தாவி வந்தேன் பொன்னியம்மா\" என்ற  பாடலை எஸ். ஜானகி, பி.எஸ்.சசிரேகா, சீர்காழி கோவிந்தராஜன் ஆகியோர் பாடினர். இந்தப் பாடலே,  பி.எஸ்.சசிரேகாவின் முதற்பாட்டு ஆகும்.\n\n", "பி. பி. ஸ்ரீனிவாஸ்": "பி. பி. ஸ்ரீநிவாஸ் (Prativadi Bhayankara Sreenivas, செப்டம்பர் 22, 1930 - ஏப்ரல் 14, 2013) தென்னிந்தியாவின் பழம்பெரும் திரைப்படப் பின்னணிப் பாடகர். இவர் தமிழ், தெலுங்கு, மலையாளம், கன்னடம், இந்தி உட்படப் 12 இந்திய மொழிகளில் ஆயிரக்கணக்கான பாடல்களைப் பாடியுள்ளார். இவர் இந்தியாவில், ஆந்திரப் பிரதேசத்தில் உள்ள காக்கிநாடா மாவட்டத்தில் பிறந்தார்.\nஸ்ரீநிவாசின் முதல் பாடல் ஜெமினி தயாரித்து 1951 இல் வெளிவந்த மிஸ்டர் சம்பத் என்ற இந்திப் படத்தில் இடம்பெற்றது. கனஹிபரது என்ற பாடலை முதன் முதலில் பாடினார். இவரது முதல் தமிழ்ப் பாடல் சிந்தனை என் செல்வமே\" என்ற பாடல், 1953 இல் வெளிவந்த ஜாதகம் படத்தில் இடம்பெற்றது.\nஆங்கிலம், உருது உட்பட எட்டு மொழிகளில் புலமை பெற்றவர். இவற்றில் பல பாடல்களையும் எழுதியுள்ளார். மதுவண்டு என்ற புனைப்பெயரில் தமிழ்க் கவிதைகளை எழுதினார். வறுமையின் நிறம் சிவப்பு, நண்டு ஆகிய திரைப்படங்களில் வரும் இந்திப்பாடல்களை இவரே இயற்றினார்.\nதமிழ்த் திரையிசை உலகில் டி. எம். சௌந்தரராஜன் புகழுச்சியில் இருந்த காலத்தில் ஸ்ரீநிவாஸ் அவருக்கு அடுத்த இடத்தில் விளங்கினார். உச்சஸ்தாயியில் பாடிவந்தோர் காலகட்டத்தில், மென்மையான குரல் கொண்டு இனிமையைக் கூட்டி, பாடுவதில் ஒரு புதிய பாணியை கொண்டுவந்தவர். 'காலங்களில் அவள் வசந்தம்' எனும் பாடலைப் பாடி பெரும்புகழை ஈட்டினார். தமிழ்ப் படங்களில் ஜெமினி கணேசனுக்கும், கன்னடத்தில் ராஜ்குமாருக்கும் இவர் அநேகமாக அவர்களின் அனைத்துப் படங்களிலும் பின்னணி பாடியுள்ளார்.", "பிரசாந்தினி": "பிரசாந்தினி தமிழில் முதன்மையாகப் பாடிவரும் ஒரு திரைப்படப் பின்னிணிப் பாடகி. இவர் புகழ்பெற்ற பாடகர் மலேசியா வாசுதேவனின் மகளும் யுகேந்திரனின் உடன் பிறந்தவரும் ஆவார். இவர் ஹாரிசு ஜெயராஜின் இசையில் உருவான 12பி என்னும் படத்தின் மூலம் பின்னணிப் பாடகியாக அறிமுகமானார்.", "பிரவீண் மணி": "பிரவீண் மணி என்பவர் ஓர் இந்திய இசைக்கலைஞர் ஆவார்.  இவர்   தமிழ், மலையாளம், தெலுங்கு இந்திய ஆங்கில திரைப்படங்களில் பாடகராகவும், இசையமைப்பாளராகவும் பணியாற்றுகிறார். இவர் நீண்டகாலமாக ஏ. ஆர். ரகுமானிடம் இணை உதவியாளராக இருந்துள்ளார். எந்திரன் . முதல்வன், அலைபாயுதே உள்ளிட்ட பல ரகுமான் இசையமைத்த படங்களின் பின்னணி இசையில் இவர் முக்கிய பங்கு வகித்துள்ளார். இவர் கனடாவின் தொராண்டோவில் வசிக்கிறார்.", "பிரியதர்ஷினி": "பிரியதர்ஷினி சிங்கப்பூர்-இந்திய திரைப்பட பின்னணி பாடகர் மற்றும் இசை ஆராய்ச்சியாளர் ஆவார்.  பரத்வாஜ் இசையமைப்பில் “காதல் டாட் காம்” படத்தில் இடம்பெற்ற “காதல் காதல்” என்ற பாடல் இவர் பாடிய முதல் திரைப்படப் பாடலாகும். இப்பாடலை இவர் பின்னணி பாடகர் ஹரிஹரனுடன் இணைந்து பாடியுள்ளார். இவர் தமிழ், தெலுங்கு, கன்னடம், மலையாளம் மற்றும் இந்தி திரைப்படங்களில் பல ஹிட் பாடல்கள் பாடி தனக்கென ஒரு அடையாளத்தை பதித்துள்ளார். பிரியதர்ஷினி ஸ்டார் விஜய் உள்ளிட்ட பல தொலைக்காட்சிகளில் சில நிகழ்ச்சிகளையும்  தொகுத்து வழங்கியுள்ளார்.", "பிரேம்ஜி அமரன்": "பிரேம் கங்கை அமரன் (பிறப்பு: பிப்ரவரி 25, 1979), பிரேம்ஜி அமரன் என்ற பெயர் மூலம் அறியப்படுகிறார். இவர் ஒரு தமிழ்த் திரைப்பட நடிகரும், பிண்னணிப் பாடகரும் ஆவார். இவர் இசையமைப்பாளர் கங்கை அமரனின் மகனும், வெங்கட் பிரபுவின் சகோதரரும் ஆவார். இவர் தமிழ்த் திரைப்படங்களில் நகைச்சுவையாளர் பாத்திரங்களில் நடித்துவருகிறார்.அவரது மேடைப் பெயர், பிரேம்ஜி உண்மையில் ஒரு எழுத்துப் பிழையாகும், ஏனெனில் இது \"பிரேம் ஜி.\", (ஜி தனது தந்தையின் பெயரைக் குறிக்கிறது). என்னா கொடும சார் இது என்ற  சொற்றொடர்களுக்காகவும் அவர் மிகவும் பிரபலமானவர் மற்றும் எவ்வளவோ பண்ணிட்டோம், இத பண்ணமாட்டோமா? இந்த வசனம், ஒரு பிரபலமான உரையாடல் சந்திரமுகி (2005) திரைப்படத்தில் நடிகர் பிரபுவால் பயன்படுத்தப்படும்.", "பெங்களூர் இலதா": "பி. ஆர். லதா (B. R. Latha) பிரபலமாக பெங்களூர் லதா (Bangalore Latha) எனப்படும் இவர் தென்னிந்திய திரையுலகில், முக்கியமாக கன்னடம் மற்றும் தெலுங்கில் பணியாற்றிய இந்திய பாடகராவார்.", "மகாலட்சுமி ஐயர்": "மகாலட்சுமி ஐயர் (Mahalakshmi Iyer) இந்தி மற்றும் தமிழ் பாடல்கள் பாடும் ஒரு இந்திய பின்னணி பாடகர் ஆவார். தெலுங்கு, மராத்தி, பெங்காலி, ஒடியா, குஜராத்தி, அசாமி மற்றும் கன்னடம் போன்ற பல இந்திய மொழிகளிலும் இவர் பாடியுள்ளார்.", "மகிழினி மணிமாறன்": "மகிழினி மணிமாறன் ஓர் தமிழ்த் திரைப்படப் பின்னணிப் பாடகி. இவர் கும்கி திரைப்படத்தின் கையளவு நெஞ்சத்திலே என்ற பாடலைப் பாடியுள்ளார், இது இவரின் முதல் திரைப்பட பாடலாகும். இவருக்கு சிறந்த பாடகிக்கான விகடன் விருதுகள் 2012 வழங்கப்பட்டுள்ளது.\nவேடந்தாங்கலுக்கு அருகில் உள்ள மாலைப்புரம் என்ற கிராமத்தில் பிறந்தவர். மணிமாறனின் இசைக்குழுவான புத்தர் கலைக்குழுவில் நாட்டுப்புற பாடல்களை பாடுபவராக உள்ளார். அவரையே இவர் திருமணம் புரிந்துள்ளார் மணிமாறனே தன்னுடைய குரு மற்றும் தன் ஊக்கத்துக்கு காரணமானவர் என்று கூறியுள்ளார். \nஇவர் எடிசன் விருது, விகடன் விருது, தஞ்சாவூர் தமிழ் இசை மன்றத்தின் இசைக்கலை அரசி  பட்டம் ஆகியவற்றைப் பெற்றுள்ளார்.", "மங்களம்பள்ளி பாலமுரளிகிருஷ்ணா": "மங்களம்பள்ளி பாலமுரளிகிருஷ்ணா (Mangalampalli Balamuralikrishna, தெலுங்கு: మంగళంపల్లి బాలమురళీకృష్ణ, சூலை 6, 1930 - நவம்பர் 22, 2016) ஒரு இந்திய கருநாடக இசைப் பாடகர், இசை மேதை, பல்-வாத்தியக் கலைஞர், பின்னணிப் பாடகர், இசையமைப்பாளர், வாக்கேயக்காரர், குணசித்திர நடிகர் என பல திறப்பட்ட கலைஞராவார்.தென்னிந்திய மொழிகள் உட்பட 8 மொழிகளில் பாடல்களைப் பாடும் திறமையுடன் விளங்கியவர்.", "மஞ்சரி (இந்தியப் பாடகர்)": "மஞ்சரி (Manjari) (பிறப்பு 17 ஏப்ரல் 1986)  இந்தியாவைச் சேர்ந்த  இந்துஸ்தானி இசைப் பாடகராவார்.     மஞ்சரி 1986இல் திருவனந்தபுரத்தில் பிறந்தார். இருப்பினும், இவர் மஸ்கட்டில் வளர்ந்தார். படங்களைத் தவிர, மஞ்சரி பல இசை ஆல்பங்களிலும் பாடியுள்ளார். இவரது முதல் நிகழ்ச்சி எட்டாம் வகுப்பில் படிக்கும்போது கொல்கத்தாவைச் சேர்ந்த 'சிவா' என்ற ராக் இசைக்குழுவுடன் இருந்தது.", "மதுஸ்ரீ": "மதுஸ்ரீ (வங்காள: মধুশ্রী) ஒரு இந்தியத் திரைப்படப் பின்னணிப் பாடகி. இவர் தமிழ் மற்றும் கன்னடம், தெலுங்கு, இந்தி போன்ற மொழித் திரைப்படங்களில் பாடியுள்ளார்.", "மரண கானா விஜி": "மரண கானா விஜி என்ற பெயரால் பெரிதும் அறியப்படும்  கானா விஜி தமிழ்த் திரைப்படங்களில் பின்னணிப் பாடகர் ஆவார். கானா பாடல்கள் என்ற இசைவகையில் மிகச் சிறந்த பாடலாசிரியராகவும் பாடகராகவும் விளங்குகிறார். கலியுகம் எனும் திரைப்படத்தில் அஜலா உஜலா என்ற பாடல் மூலம் பிரபலமானார்.", "மரியா ரோ வின்சென்ட்": "மரியா ரோ வின்சன்ட் (Mariya Ro Vincent) ஒரு திரைப்படப்பாடகர், இசையமைப்பாளர் மற்றும் குரல் ஏற்பாட்டாளர் ஆவார். ஏ.ஆர்.ரஹ்மான் , ஹாரிஸ் ஜெயராஜ், டி. இம்மான் , விஜய் ஆண்டனி, ஸ்ரீனிவாஸ், அனிருத் ரவிச்சந்தர், எஸ்.ஜே. சூர்யா மற்றும் ஜோஷ்வா ஸ்ரீதர் போன்ற சிறந்த இசை இயக்குனர்களுடன் பணிபுரிந்துள்ளார். அவரது வெற்றி பாடல்களில் சில கடல் திரைப்படத்தில் இருந்து \"அடியே\", வணக்கம் சென்னை திரைப்படத்தில் இருந்து \"ஹே\" போன்றவை அடங்கும். கடல், மரியான், நெடுஞ்சாலை, மில்லியன் டாலர் ஆர்ம், யாமிருக்க பயமேன் மற்றும் இது போன்ற பல வெற்றித் திரைப்படங்களில் அவரது குரல் இடம்பெற்றுள்ளது. மலேசியாவில் நடைபெற்ற விஜய் தொலைக்காட்சியின் \"ஏர்டெல் சூப்பர் சிங்கர்\" மற்றும் மழவில் மனோரமாவின் \"ஜோஸ்கோ இந்திய குரல்\" மற்றும் மலேசியாவில் உள்ள ஆஸ்ட்ரோ தொலைக்காட்சியில் \"சூப்பர் ஸ்டார்\" போன்ற பல்வேறு தொலைக்காட்சி நிகழ்ச்சிகளை ஏற்பாடு செய்யவும், தயாரிக்கவும் அவருக்கு வாய்ப்பு கிடைத்தது. எல் ஃபெ என்றழைக்கப்படும் குரல் இசைக்குழுவின் முன்னணி பாடகராகவும், பல்வேறு இசை நிகழ்ச்சிகளிலும் ஈடுபடுகிறார்.", "மலேசியா வாசுதேவன்": "மலேசியா வாசுதேவன் (Malaysia Vasudevan) (சூன் 15, 1944 - பெப்ரவரி 20, 2011) ஒரு தென்னிந்தியத் திரைப்படப் பாடகரும் நடிகரும் ஆவார். எட்டாயிரத்திற்கும் அதிகமான தமிழ்த் திரைப்பாடல்களைப் பாடியவர்.", "மனோ": "மனோ (தெலுங்கு: మనో) (பிறப்பு அக்டோபர் 26, 1965) தென்னிந்தியத் திரைப்படங்களில் பாடிவரும் ஒரு திரைப்படப் பின்னணிப் பாடகர். இவர் தமிழ், மலையாளம், தெலுங்கு, கன்னடம் மற்றும் இந்தி மொழிகளில் பாடியுள்ளார். தமது திரைவாழ்வை நடிகராகத் துவங்கி பின்னர் பின்னணிப் பாடகராக புகழ்பெற்றார். சின்னத் தம்பி என்ற படத்தில் \"தூளியிலே\" என்ற பாடலுக்காக தமிழ்நாடு அரசு விருது பெற்றார்.", "மஹதி (பாடகி)": "மஹதி (பிறப்பு: 10 பிப்ரவரி 1985) தமிழகத்தைச் சேர்ந்த கருநாடக இசைப் பாடகர் ஆவார். தமிழ்த் திரைப்படங்களில் பின்னணிப் பாடகியாகவும் செயல்படுகிறார்.", "மால்குடி சுபா": "மால்குடி சுபா ஓர் இந்தியத் திரைப்படப் பின்னணிப் பாடகியும் பாப் இசைப் பாடகியும் ஆவார். இவர் தமிழ், தெலுங்கு, கன்னடம், மலையாளம், இந்தி முதலிய மொழிப் படங்களில் மொத்தம் 2500 பாடல்களுக்கும் மேலாகப் பாடியுள்ளார்.இவர் உயிரே படத்தில் உள்ள தய்யா தய்யா என்ற பாடல் மூலம் மிக பிரபலமானவர்.\nஇவர் இளையராசாவின் இசையில் உருவான நாடோடித் தென்றல் படத்தில் பின்னணிப் பாடகியாக அறிமுகமானார்.\nமேலும் இவர் தென்னிந்தியத் திரைப்பட நடிகை பிரியாமணியின் உறவினர்.", "மாலதி லட்சுமணன்": "மாலதி லட்சுமணன் தமிழ்த் திரைப்பட பின்னணிப் பாடகி ஆவார். மன்மத ராசா பாடலை பாடியதன் மூலம் பரவலாக அறியப்படுகிறார்.\n\n", "மின்மினி": "மின்மினி (Minmini) தென்னிந்திய திரைப்பட பின்னணிப் பாடகி ஆவார். இவர் இளையராஜா மற்றும் ஏ. ஆர். ரகுமான் இசையில் பாடல்கள் பாடியுள்ளார். ரோஜா  திரைப்படத்தில் சின்ன சின்ன ஆசை பாடலை பாடியதன் மூலம் பரவலாக அறியப்படுகிறார்.", "மேகா (பாடகர்)": "மேகா (Megha) என்று அழைக்கப்படும் ஹரிணி ராமச்சந்திரன், மார்ச்சு 18, 1987இல் பிறந்த  தமிழ் பின்னணிப் பாடகர் ஆவார். இவர்,  தமிழ், தெலுங்கு, மலையாளம் மற்றும் கன்னட மொழிகளில் பாடுகிறார். இவர் \"ஸ்கூல் ஆப் எக்ஸெலன்ஸின் துணை-நிறுவனர் ஆவார்.", "யுகேந்திரன்": "யுகேந்திரன் ஒரு இந்தியத் திரைப்படப் பின்னணிப் பாடகரும் நடிகரும் ஆவார். இவர் இது வரை 600-க்கும் மேற்பட்ட பாடல்களைப் பாடியுள்ளார்.. மேலும் இவர் சில படங்களுக்கு இசையமைத்தும் உள்ளார்.", "யுவன் சங்கர் ராஜா": "யுவன் சங்கர் ராஜா (Yuvan Shankar Raja; பிறப்பு: ஆகத்து 31, 1979) தமிழ்த் திரைப்பட இசைக்கலைஞர், பின்னணி பாடகர், பாடல் ஆசிரியர் ஆவார். பெரும்பான்மையாக தமிழ் படங்களிள் பணியாற்றுகிறார். பல்துறை இசையமைப்பாளராகக் கருதப்படும் இவர், குறிப்பாக மேற்கத்திய இசையைப் பயன்படுத்தியதற்காக அறியப்படுபவர் , மேலும் தமிழ் திரைப்படம் மற்றும் இசைத் துறையில் ஹிப் ஹாப் இசையை அறிமுகப்படுத்தியவர் . தமிழ் நாட்டில் \"ரீமிக்ஸ்” கலாச்சாரத்தை தொடங்கி அதனை பிரபலபடுத்தியவர். ராம் படத்தின்  இசைக்காக 2006 இல் சைப்ரஸ் சர்வதேச திரைப்பட விழாவில் விருதை வென்ற ஒரே இந்திய இசையமைப்பாளர் இவர். அவரது குறிப்பிடத்தக்க படைப்புகள் மற்றும் விசுவாசமான ரசிகர் பட்டாளம் அவருக்கு \"யூத்  ஐகான்\" என்ற புனைப்பெயரைப் பெற்றுத்தந்தது.\n15 வருட காலத்திற்குள், யுவன் சங்கர் ராஜா 100 க்கும் மேற்பட்ட படங்களில் பணியாற்றியுள்ளார். புகழ்பெற்ற இசையமைப்பாளர் இளையராஜாவின் இளைய மகனான இவர் , 1996 ஆம் ஆண்டில், தனது 16 வயதில், அரவிந்தன் என்ற திரைப்படத்திற்காக  இசையமைத்து , தனது இசை வாழ்க்கையைத் தொடங்கினார். அவர் துள்ளுவாதோ இளமை (2001) படத்தின் இசை மூலம் தமிழ் திரை உலகில் பிரபலமானார், மேலும் 2000 களின் நடுப்பகுதியில் தமிழ் சினிமாவின் மிகவும் விரும்பப்பட்ட இசையமைப்பாளர்களில் ஒருவராக உருவெடுத்தார். 2015 ஆம் ஆண்டில், அவர் தனது சொந்த இசை லேபிளான U1 ரெக்கார்ட்ஸை உருவாக்கி, 2017 ஆம் ஆண்டில், தனது சொந்த திரைப்பட தயாரிப்பு ஸ்டுடியோ, ஒய்.எஸ்.ஆர் பிலிம்ஸ் தொடங்கினார்.\nயுவன் இரண்டு பிலிம்பேர் விருதுகளை வென்றுள்ளார்; 2004 ஆம் ஆண்டில், 7 ஜி ரெயின்போ காலனி படத்திற்காக சிறந்த இசையமைப்பாளர் விருது மற்றும் 2009 ஆம் ஆண்டில் ஒய்! என்ற தெலுங்கு திரைப்படத்திற்காக பிலிம்பேர் சிறப்பு விருது விருதினைப் பெற்றார். பிலிம்பேர் விருதுகளுக்காக ஆறு பரிந்துரைகளையும், 2006 மற்றும் 2010 ஆம் ஆண்டுகளில் இரண்டு தமிழக மாநில திரைப்பட விருதுகளையும் பெற்றுள்ளார்.", "ரஞ்சித் (பாடகர்)": "கே. ஜி. ரஞ்சித்,(Ranjith (Singer)) தமிழ், தெலுங்கு, மலையாளம் மற்றும் கன்னடத் திரையுலகில் பணிபுரிந்த இந்திய பின்னணிப் பாடகர் ஆவார்.", "ராக்ஸ்டார் இரமணி அம்மாள்": "ரமணி அம்மாள் (Ramani Ammal) தனது மேடைபெயரான ராக்ஸ்டார் ரமணி அம்மாள் எனப் பிரபலமாக அறியப்பட்ட ஒரு இந்திய நாட்டுப்புறப் பாடகியும், திரைப்பட பின்னணி பாடகியும் ஆவார். 1954இல் சென்னை மேற்கு மாம்பலம் பகுதியில் பிறந்த இவர் 2017 ஆம் ஆண்டில் ஜீ தமிழ் தொலைக்காட்சியில் ஒளிபரப்பான ச ரி க ம ப சீனியர்ஸ் என்ற தொலைக்காட்சி நிகழ்ச்சியில் பங்கேற்ற பிறகு இவர் முக்கியத்துவம் பெற்றார்.   ச ரி க ம ப சீனியஸ் நிகழ்ச்சியின் தொடக்க பதிப்பின் நடுவர்களிடமிருந்து \"ராக்ஸ்டார்\" என்ற புனைப்பெயரைப் பெற்றார். மேலும், இவர் காதல் (2004) என்றப் படத்தில் பின்னணி பாடகியாகவும் அறிமுகமானார்.", "ராகுல் நம்பியார்": "ராகுல் நம்பியார் (Rahul Nambiar) ஒரு இந்திய பின்னணி பாடகர் மற்றும் இசை நிகழ்த்து கலை நிகழ்ச்சியாளர் ஆவார்.  முதுகலை வணிக மேலாண்மை மற்றும் பொருளாதாரத்தில் முதுகலை பட்டம் பெற்றவர், அவர் 2001 இல் சப்தஸ்வரங்கல் நிகழ்ச்சியை வென்றார் மற்றும் நேரடி பாடல்களை பாடத் தொடங்கினார்.  பின்னர் அவர் பின்னணி பாடகரானார் , பல்வேறு மொழிகளில் பல முன்னணி தென்னிந்தியத் திரைப்பட இசை நிகழ்ச்சிகளை நிகழ்த்துகிறார் மேலும் பாஸ் பிளேயர் ஆலாப் ராஜூவுடன் இணைந்து ராஹ்லாப் என்ற  ஒரு இசைக்குழுவைத்  தொடங்கினார் .", "ராஜ்குமார் பாரதி": "ராஜ்குமார் பாரதி கருநாடக இசைப் பாடகரும், இசையமைப்பாளரும் ஆவார். இவர் மறுமலர்ச்சி கவிஞர் மகாகவி சுப்பிரமணிய பாரதியின் கொள்ளுப் பேரனாவார்.", "ராஜலட்சுமி (பாடகி)": "ராஜலட்சுமி என்பவர் 13 அக்டோபர் 1983 இல் பிறந்த மலையாளப் பின்னணிப் பாடகி ஆவார். இவர் 1994 இல் இருந்து தென் இந்திய மொழிகளான தமிழ், மலையாளம் மற்றும் கன்னட மொழிகளில் பாடுகிறார். இவர் 2009 ஆம் ஆண்டில் ஷாஜி என். கருண் இயக்கிய குட்டிஸ்ராங்க் என்ற திரைபபடத்தில் பாடியதற்காக சிறந்த பாடகிக்கான தேசிய விருதுக்கு பரிந்துரை செய்யப்பட்டார். 2011 இல் கேரளா மாநில திரைப்பட விருது, 2004 மற்றும் 2014 ஆம் ஆண்டுகளில் சிறந்த பின்னணி பாடகருக்கான கேரள மாநில சங்கீதா நாடக அகாடமி விருது, 2017 இல் மழவில் மங்கோ இசை விருது மற்றும் 2018 இல் பிளவர்ஸ் இசை விருது போன்ற விருதுகளை வென்றுள்ளார்.", "ராஜேஷ் கிருஷ்ணன்": "ராஜேஷ் கிருஷ்ணன், (Rajesh Krishnan) ஜூன் 3, 1974 இல் பிறந்த ஒரு இந்திய மெல்லிசை பின்னணிப் பாடகர் மற்றும் திரைப்பட நடிகர் ஆவார். கன்னடத் திரைப்படங்களில் அவரது பாடல்கள் பிரபலமாக உள்ளது. அவர் கன்னடத் திரையுலகில் 5000 க்கும் மேற்பட்ட பாடல்களை, 1100 படங்களுக்கு மேலாகப் பாடியுள்ளார். மற்றும் 500  தெலுங்குப் பாடல்களை ஆந்திரத் திரைப்படத்துறையிலும் மற்றும் 500 பாடல்களை தமிழ் , மற்றும் இந்தி  திரைப்படங்களுக்காகப் பாடியுள்ளார். மற்றும் 17 பிராந்திய மொழிகளில் திரைப்பட பாடல்களைப் பாடியுள்ளார். இவர், கௌரி கணேசா (1991) படத்தில் அறிமுகமானார். இவர், இரண்டு தசாப்தங்களுக்கு மேலாக பல பக்தி பாடல்கள் அடங்கிய இசை தொகுப்புகள், கருப்பொருள் சார்ந்த இசைத்தொகுப்புகள், மற்றும் வணிக விளம்பரங்களுக்கு அவர் பாடியுள்ளார்.", "ரீடா தியாகராஜன்": "ரீடா தியாகராஜன் ( Ritha Thiyagarajan) என்கிற சுசரித்ரா தியாகராஜன் 1984, ஜூன் 10 அன்று பிறந்த ஒரு இந்திய பின்னணிப் பாடகர் ஆவார்.\"ரீடா\" எனவும் அறியப்படும் இவர் தமிழ், தெலுங்கு, கன்னடம் மற்றும் மலையாளத் திரைப்படங்களில் பாடியுள்ளார்.", "ரோஷினி (பாடகி)": "ரோஷினி ஒரு இந்தியப் பின்னணிப் பாடகி ஆவார். இவர் தமிழ்நாட்டைச் சேர்ந்தவர். இவரது தந்தை திருச்சிராப்பள்ளியில் உள்ள புனித சூசையப்பர் கல்லூரியின் தமிழ்ப் பேராசிரியராக இருந்த ஜோசப் கலியபெருமாள் ஆவார். திருச்சிராப்பள்ளி மற்றும் சென்னை வளர்க்கப்பட்ட இவர், தமிழ், தெலுங்கு மற்றும் மலையாள மொழிகளில் பின்னணி பாடுவதில் பிரபலமானவர். விஜய் தொலைக்காட்சியில் தமிழ் ரியாலிட்டி காட்சிகளிலும் சூப்பர் சிங்கரின் ஏழாவது பதிப்பிலும் போட்டியிட்டார். சென்னை ராஜலட்சுமி பொறியியல் கல்லூரியில் கணினி பொறியியலில் பி.இ. பட்டம் பெற்றுள்ளார்.", "லக்சிமி சிவனேஸ்வரலிங்கம்": "லக்சிமி சிவனேஸ்வரலிங்கம் (Luksimi Sivaneswaralingam, பிறப்பு: செப்டம்பர் 26, 1990) தமிழ்த் திரைப்படப் பின்னணிப் பாடகி ஆவார். பல்வேறு வகையிலான பாடல்களை யூடியூப், இன்ஸ்ட்டாகிராம் ஆகியவற்றின் ஊடாகப் பகிர்ந்து வருகிறார்.", "விக்ரம்": "விக்ரம் (17 ஏப்ரல் 1966) என்பவர் தமிழ்நாட்டுத் திரைப்பட நடிகர், திரைப்படத் தயாரிப்பாளர், பின்னணிப் பாடகர் மற்றும் குரல் நடிகர் ஆவார். இவர் 1990 ஆம் ஆண்டு முதல் சேது  (1999), விண்ணுக்கும் மண்ணுக்கும் (2001), சாமி (2003), பிதாமகன் (2003), ஐ (2015) போன்ற தமிழ் மொழி திரைப்படங்களிலும், தெலுங்கு மற்றும் மலையாளத் திரைப்படங்களிலும் நடித்ததன் மூலம் தமிழ்த் திரையுலகின் முன்னணி நடிகர்களில் ஒருவராவார்.\nஇவர் தமிழ்த் திரைப்படத் துறையில் பணி புரிந்த வரையில் 7 பிலிம்பேர் விருதுகள் பெற்றுள்ளார். அது மட்டுமின்றி சிறந்த நடிகருக்கான ஒரு தேசிய விருதும் தமிழ் நாடு மாநில விருதும் பெற்றுள்ளார். இவருக்கு மிலான் பல்கலைக்கழகம் 2011 ஆம் ஆண்டு மே மாதம் அன்று கௌரவ டாக்டர் பட்டம் வழங்கியது. தனது நடிப்பாற்றல் மூலமாகத் தமிழ்த் திரையுலகில் முன்னணி இடம் வகிக்கும் நடிகருள் இவரும் ஒருவர்.விக்ரம் வெவ்வேறு சமூக நிகழ்ச்சிகளை முன் நின்று நடத்தியுள்ளார். இவர் ஐக்கிய நாடுகளின் குடிசார் அமைப்பின்  தூதர். சஞ்சீவனி அறக்கட்டளையின் தூதுவராகவும் வித்யா சுதா, என்னும் மாற்றுத் திறன் பள்ளியின்  தூதுவராகவும் உள்ளார். காசி கண் நலப்பணியின் வேளையிலும் தன்னை ஆட்படுத்திக் கொண்டார். விக்ரம் நிறுவனம் மூலம் பல நலத் திட்டங்களை செயல்படுத்தி வருகிறார்.", "விது பிரதாப்": "விது பிரதாப் (Vidhu Prathap, பிறப்பு: 1, செப்டம்பர், 1980) என்பவர் ஒரு இந்திய பின்னணி பாடகராவார். இவர்   மலையாளத்தில் நானூறுக்கும் மேற்பட்ட படங்களிலும், ஒரு சில தமிழ், கன்னடம் மற்றும் தெலுங்கிலும் பல பாடல்களைப் பாடியுள்ளார்.", "விவேக் (நடிகர்)": "விவேக் (Vivek, 19 நவம்பர் 1961 - 17 ஏப்ரல் 2021) தமிழ்த் திரைப்பட நகைச்சுவை நடிகர் ஆவார். இவரது நகைச்சுவை இலஞ்சம், மக்கள்தொகைப் பெருக்கம், அரசியல் ஊழல்கள், மூட நம்பிக்கைப் போன்றவற்றை இடித்துரைப்பதால் இவரை சிலர் சின்னக் கலைவாணர் என்றும் சனங்களின் கலைஞன் என்றும் அடைமொழியிட்டு அழைக்கின்றனர்.\n\n", "விஜய் (நடிகர்)": "விஜய் (ஆங்கில மொழி: Vijay, பிறப்பு: சூன் 22, 1974; இயற்பெயர்: ஜோசப் விஜய்) தமிழ்த் திரைப்பட நடிகர் ஆவார். தொடக்கத்தில் இவர் தனது தந்தையான எஸ். ஏ. சந்திரசேகர் இயக்கிய திரைப்படங்களில் நடித்து வந்தார். ஏறத்தாழ 10 படங்களுக்குப் பிறகு தனது இடத்தைத் தக்கவைத்துக் கொண்டார். இவர் தற்போது தமிழ்த் திரைப்படத்துறையில் முதன்மை நடிகர்களுள் ஒருவராகக் காணப்படுகிறார். விஜயின் ரசிகர்கள் அவரை \"இளையதளபதி\" என்று அழைக்கிறார்கள். இவருக்குப் புலம்பெயர்ந்த இந்தியர்கள் உட்பட சீனா, சப்பான், ஐக்கிய இராச்சியம் மற்றும் பிரான்ஸ் ஆகிய நாடுகளில் நேயர்கள் உள்ளனர். இவரது படங்கள் ஐந்து கண்டங்கள் மற்றும் எண்பது நாடுகளில் வெளியாகி உள்ளன.விஜய் தனது 10வது வயதில் வெற்றி (1984) என்ற திரைப்படத்தில் குழந்தை நடிகராக அறிமுகம் ஆனார். தனது தந்தை இயக்கிய இது எங்கள் நீதி (1988) திரைப்படம் வரை குழந்தை நடிகராகத் தொடர்ந்து நடித்தார். பின்னர் 18ம் வயதில் தன் தந்தை இயக்கிய நாளைய தீர்ப்பு (1992) படத்தில் முதன்முறையாக முதன்மை நடிகராக நடித்தார். ஆனால் விக்ரமன் இயக்கிய பூவே உனக்காக (1996) திரைப்படம் தான் இவருக்குத் திருப்புமுனையாக அமைந்தது. இன்று வரை விஜய் கதாநாயகனாக 62 திரைப்படங்களில் நடித்துள்ளார். 3 தமிழக அரசு திரைப்பட விருதுகள், 1 காஸ்மோபாலிடன் விருது, 1 இந்தியா டுடே விருது, 1 சிமா விருது, 8 விஜய் விருதுகள், 3 எடிசன் விருதுகள், 2 விகடன் விருதுகள் உட்பட 50 விருதுகளை வென்றுள்ளார். ஒரு முறை ஐக்கியப் பேரரரசின் நாட்டு திரைப்பட விருதுகளுக்குப் பரிந்துரைக்கப்பட்டுள்ளார்.ஒரு பின்னணிப் பாடகராக பம்பாய் சிட்டி (1994) முதல் பாப்பா பாப்பா (2017) வரை விஜய் 32 பாடல்களைப் பாடியுள்ளார். நடிப்பு மற்றும் பாடல்கள் தவிர இவர் ஒரு சிறந்த ஆடல் கலைஞர். இவரது படங்கள் சீனாவின் ஷாங்காய் பன்னாட்டுத் திரைப்பட விழா, ஆஸ்திரேலியாவின் மெல்போர்ன் சர்வதேசத் திரைப்பட விழா மற்றும் தென்கொரியாவின் புச்சியான் பன்னாட்டுத் திரைப்பட விழா ஆகிய திரைப்பட விழாக்களில் திரையிடப்பட்டுள்ளன.", "விஜய் ஆண்டனி": "விஜய் ஆண்டனி  (பிறப்பு: சூலை 24, 1975) இந்தியா, தமிழ்நாட்டின் ஓர் முன்னணி திரைப்பட இசையமைப்பாளர் ஆவார். தற்போது திரைப்படத்தில் நடிப்பதிலும் ஆர்வம் காட்டி வருகிறார்.\n\n", "விஜய் பிரகாஷ்": "விஜய் பிரகாஷ் ஒரு திரைப்பட பின்னணி பாடகர். தமிழ், தெலுங்கு, மலையாளம், இந்தி ஆகிய மொழி படங்களில் பின்னணி பாடல்களைப் பாடியுள்ளார்.", "வெங்கட் பிரபு": "வெங்கட் குமார் கங்கை அமரன்(பிறப்பு: நவம்பர் 7, 1975), வெங்கட் பிரபு என்ற பெயர் மூலம் அறியப்படுகிறார். இவர் ஒரு தமிழ்த் திரைப்பட நடிகர், திரைப்பட இயக்குநர், பின்னணிப் பாடகர் , திரைக்கதை ஆசிரியர் ஆவார். இவர் இசையமைப்பாளர் கங்கை அமரனின் மகன். தனது கல்வியை முடித்த பின்னர், அவர் ஒரு நடிப்பு வாழ்க்கையைத் தொடங்கினார், அவரது முதல் மூன்று முயற்சிகள் அவரை ஒரு நட்சத்திர வேடத்தில் நடிக்க வைத்தது, திரைப்படங்களை வெளியிடத் தவறிவிட்டன, அதைத் தொடர்ந்து அவர் கதாபாத்திர வேடங்களில் தோன்றத் தொடங்கினார் . கோடைக்கால வெற்றியான சென்னை 600028 (2007) உடன் இயக்குனராக மாறியபோது முதல்முறையாக அவர் கவனத்தை ஈர்த்தார். அவர் தனது அடுத்தடுத்த இயக்கிய திரைப்படங்களான சரோஜா (2008) மூலம் மேலும் வணிக வெற்றிகளைப் பெற்றார் ,கோவா (2010), மங்கத்தா (2011), பிரியாணி (2013) மற்றும் மாஸ் மசிலாமணி (2015). இவரது தந்தை கங்கை அமரன் திரைப்பட இயக்குனர் மற்றும் இசை இயக்குனர் மற்றும் பாடலாசிரியர் ஆவார்.", "வேல்முருகன்": "வேல்முருகன் (Velmurugan) என்பவர் ஒரு தென்னிந்திய தமிழ்த் திரைப்பட பின்னணிப் பாடகர் ஆவார். இவர் சுப்ரமணியபுரம் படத்தில்  மதுர குலுங்க,  நாடோடிகள் படத்தில் ஆடுங்கடா, ஆடுகளம் படத்தில் ஒத்த சொல்லால போன்ற நாட்டுப்புற பாடல்களைப் பாடி புகழ் பெற்றார். ஜேம்ஸ் வசந்தனால் பாட அழைக்கப்பட்டது இவரது வாழ்க்கையின் ஒரு திருப்புமுனை என இவர் கருதுகிறார். இவர் தன்னுடன் படித்த கலா என்னும் நபரை திருமணம் செய்து கொண்டார்.", "வைக்கம் சரஸ்வதி": "வைக்கம் சரஸ்வதி (Vaikom Saraswathi) தென்னிந்திய கருநாடக இசைப் பாடகியும், திரைப்படப் பின்னணிப் பாடகியும் ஆவார். இவர் பாடிய பல கருநாடக இசைப் பாடல்கள் இசைத்தட்டுகளில் வெளிவந்துள்ளன. இந்திய வானொலிகளில் 1940கள், 50களில் இவரது கச்சேரிகள் ஒலிபரப்பப்பட்டுள்ளன.\n\n", "வைசாலி சமந்த்": "வைசாலி சமந்த் (Vaishali Samant) இவர் ஓர் இந்திய இசை அமைப்பாளரும், பாடலாசிரியரும் மற்றும் பின்னணி பாடகியுமாவார். இவர் மராத்தி திரைப்படம் மற்றும் இசைத் துறையில் பணியாற்றியதற்காக பிரபலமாக அறியப்படுகிறார். தொலைக்காட்சி நிகழ்ச்சிகளில் ஒளிபரப்பப்படும் மெய்நிகர் பாடும் போட்டி நிகழ்ச்சிகளில் நடுவராகவும் இருக்கிறார். இவர் பெங்காலி, குஜராத்தி, போஜ்புரி, அசாமி, தமிழ் மற்றும் தெலுங்கு மொழிகளில் பாடியுள்ளார். இவர் மராத்தியில் மட்டும் 2000 பாடல்களுக்கு மேல் பாடியுள்ளார். இவரது \"ஐகா தாஜிபா\", \" கோம்பாடி பாலாலி \", \"நாட் குலா\" மற்றும் \"துர்ச்சியா ரனாத்\" போன்ற பிரபலமான பாடல்கள் பெரிய வெற்றியைப் பெற்றன. மேலும் இவர் ஏ. ஆர். ரகுமான், விஜு ஷா மற்றும் தபூ மாலிக் போன்ற இசை இயக்குனர்களுக்காகவும் இவர் பாடியுள்ளார். \"கொம்படி படாலி\" என்ற மிகவும் பிரபலமான மராத்தி பாடல் இவரது அனைத்து இசை நிகழ்சிகளிலும் பாடுமாறு கேட்டுக்கொள்ளப்படுகிறார்.", "ஜாலி ஆபிரகாம்": "ஜாலி ஆபிரகாம் (Jolly Abraham) என்பவர் ஒரு இந்திய ஸ்தோத்திர பாடகர்  மற்றும் மலையாள திரைப்பட பாடகராவார். இவர் 1970 கள் மற்றும் 1980 களில் 100 க்கும் மேற்பட்ட மலையாள திரைப்படப் பாடல்களைப் பாடினார். சில படங்களிலும் நடித்துள்ளார். இவரது முதல் பாடல் 1973 இல் சட்டம்பிகல்யாணிக்காக ஆகும். இவர் எர்ணாகுளம், கும்பலத்தில் பிறந்தார். கொச்சியின் சேக்ரட் ஹார்ட் கல்லூரி தேவராவில் பி. எஸ். சி தாவரவியலில் பட்டம் பெற்றவர் . இவர் ஒரு சில தமிழ், தெலுங்கு, கன்னட திரைப்படங்களில் பாடல்களை பாடியுள்ளார்.  திருமணமான இவர் சென்னையில் வசிக்கிறார்.", "ஜி. கே. வெங்கடேசு": "குருஜாதா கிருஷ்ணாதஸ் வெங்கடேஷ் (ஜி.கே.வி) (G. K. Venkatesh, 21 செப்டம்பர் 1927 –  13 நவம்பர் 1993) என்பவர் கன்னட திரையுலகில் இசை அமைப்பாளராக பணியாற்றியுள்ளார். இவர் 1960 களில், 1970 களில் மற்றும் 1980 களில் புகழ்பெற்ற இசைகளை அமைத்துள்ளார். தென்னிந்திய மொழிகளான தமிழ், மலையாளம், தெலுங்கு திரைப்படங்களில் பணியாற்றினார்.\nஇவரிடம் இளையராஜா உதவியாளராக பணியாற்றினார். 200 திரைப்படங்களுக்கும் மேற்பட்ட திரைப்படங்களுக்கு இருவரும் இணைந்திருந்த போது  ஜிகேவி  இசையமைத்துள்ளார்.", "ஜி. வேணுகோபால்": "ஜி வேணுகோபால் (G. Venugopal) (பிறப்பு: திசம்பர் 10, 1960) மலையாள திரைப்படங்களில் பணியாற்றியதற்காக அறியப்பட்ட ஒரு இந்திய பின்னணி பாடகராவார். \"ஓடருத்தம்மாவ ஆளரியாம்\" (1984) திரைப்படத்தில் தனது பாடலைத் தொடங்கினார்.  அதன் பின்னர் இவர் 300க்கும் மேற்பட்ட படங்களில் பாடியுள்ளார். 500க்கும் மேற்பட்ட தனி இசைத் தொகுப்புகளையும் கொண்டுள்ளார். சேர்த்தலை கோபாலன் நாயர், மாங்காடு நடேசன்,  பி. சசிகுமார், பாலகுலங்கரா அம்பிகாதேவி, பெரும்பாவூர் இரவீந்திரநாத், வி சுப்பிரமணியம் ஆகியோர் அடங்குவர். பிரபல இசைக்கலைஞர் எம். ஜி. ராதாகிருஷ்ணன் போன்றவர்கள் இவரது வழிகாட்டிகளாகவும் ஆசிரியர்களாகவும் இருந்து இவரது வாழ்க்கையை வடிவமைப்பதில் செல்வாக்கு செலுத்தியவர் ஆவர்.", "ஹரிசரண்": "ஹரிசரண் தமிழ் திரைப்படப் பின்னணிப் பாடகர் ஆவார்.இவர் தன் பதினேழாவது அகவையில் 2004ஆம் ஆண்டு வெளிவந்த காதல் திரைப்படத்தின் மூலம் அறிமுகமானார். இவரை அறிமுகம் செய்தவர் ஜோஷ்வா ஸ்ரீதர்  ஆவார். அரங்கேற்ற திரைப்படத்தில் மூன்று பாடல்கள் பாடியுள்ளார்.இவர் தமிழ் மற்றும் மலையாள மொழி திரைப்படங்களிலும் பாடல்கள் பாடி வருகிறார்.யுவன் சங்கர் ராஜாவின் இசையில் நிறைய பாடல்கள் பாடியுள்ளார். \n\n", "ஹரிணி": "ஹரிணி ஒரு தென்னிந்தியத் திரைப்படப் பாடகி. ஹரிணி  இந்திரா(1995) திரைபடத்தில் ஏ. ஆர். ரகுமான் இசையில் 'நிலா காய்கிறது' பாடலை முதன் முதலில் தமிழில் பாடினார்.\n\n", "ஹரிணி ரவி": "ஹரிணி ரவி (Harini Ravi, பிறப்பு: திசம்பர் 20, 1994) ஒரு பாடகராகவும் குரல் வழங்குனராகவும் (Dubbing Artiste) அறியப்படுகின்றார்.  இவர் வயலின் இசைக் கலைஞர் வி. வி. ரவி மற்றும் குரல் வழங்குனர் விசாலம் ரவி ஆகியோரின் மகள்.", "ஹரிஹரன் (பாடகர்)": "ஹரிஹரன் ஒரு திரைப்பட பின்னணிப் பாடகர். இவர் கேரளாவிலுள்ள திருவனந்தபுரத்தில் 03.04.1955 அன்று பிறந்தார்.. தமிழ், தெலுங்கு, மலையாளம், இந்தி, மராத்தி ஆகிய மொழி படங்களில் பின்னணி பாடல்களைப் பாடியுள்ளார். கசல் பாடல்களைப் பாடுவதில் தேர்ச்சிப் பெற்ற இவர், கலோனியல் கசினிஸ் என்ற இசைக் குழுவின் உறுப்பினர். லெஸ்லி லூயிசும் ஹரிஹரனும் சேர்ந்து நடத்தும் இந்தக் குழு பல தனி பாடல் தொகுப்புகளை வெளியிட்டுள்ளது. 2009ல் மோதி விளையாடு என்ற தமிழ்ப்படத்திற்குப் பின்னணி இசையும் அமைத்துள்ளது.\n\n", "ஹிப்ஹாப் தமிழா": "ஹிப்ஹாப் தமிழா (ஆங்கில மொழி: Hiphop Tamizha) என்பது ஒரு தமிழ்நாட்டு தமிழ் சொல்லிசை இசைக்குழு ஆகும். இதில் ஆதியும் ஜீவாவும் முக்கிய கலைஞர்கள் ஆவார்கள். 2015இல் இருந்து இவர் தமிழ்த் திரைப்படங்களில் இசையமைத்து வருகிறார். இவர் பல ஆல்பம் பாடல்களுக்கு இசையமைத்துள்ளார். இவர் ஆம்பள திரைப்படத்தின் வழியாக திரைக்கு அறிமுகமானார். இவர்கள் இந்தியாவில் தமிழ் சொல்லிசையின் முன்னோடி இசைக்குழுக்களில் ஒன்றாக கருதப்படுகிறார்கள்.", "பயனர்:VENNILA M/மணல்தொட்டி": "சாம் விசால் (Sam Vishal J.X.) (பிறப்பு: செப்டம்பர் 28, 1999) ஓர் இந்தியப் பின்னணி பாடகர். 2019 ஆம் ஆண்டில், புன்யா செல்வாவுடன் இணைந்து சூப்பர் சிங்கர் 7 மெய் நிகழ்ச்சியில் 3வது இடத்தைப் பிடித்தார்.  இந்த நிகழ்ச்சியில் 3வது இடத்தைப் பிடித்ததற்காக, இசை அமைப்பாளர் அனிருத் ரவிச்சந்திரன் - 'சிட்டி ஸ்டோரி' மற்றும் 'புட்டா ஸ்டோரி' ('குட்டி ஸ்டோரி' இன் தெலுங்கு மற்றும் கன்னட பதிப்புகள்) பாடல்களைப் பாடுவதற்கான வாய்ப்பை இவருக்கு அளித்தார்."}